Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_RISC_SECCFGR4_SEC159_B_0X0        (0x0u<<31)
#define RIFSC_RISC_SECCFGR4_SEC159_B_0X1        (0x1u<<31)
#define RIFSC_RISC_SECCFGR4_SEC158_B_0X0        (0x0u<<30)
#define RIFSC_RISC_SECCFGR4_SEC158_B_0X1        (0x1u<<30)
#define RIFSC_RISC_SECCFGR4_SEC157_B_0X0        (0x0u<<29)
#define RIFSC_RISC_SECCFGR4_SEC157_B_0X1        (0x1u<<29)
#define RIFSC_RISC_SECCFGR4_SEC156_B_0X0        (0x0u<<28)
#define RIFSC_RISC_SECCFGR4_SEC156_B_0X1        (0x1u<<28)
#define RIFSC_RISC_SECCFGR4_SEC155_B_0X0        (0x0u<<27)
#define RIFSC_RISC_SECCFGR4_SEC155_B_0X1        (0x1u<<27)
#define RIFSC_RISC_SECCFGR4_SEC154_B_0X0        (0x0u<<26)
#define RIFSC_RISC_SECCFGR4_SEC154_B_0X1        (0x1u<<26)
#define RIFSC_RISC_SECCFGR4_SEC153_B_0X0        (0x0u<<25)
#define RIFSC_RISC_SECCFGR4_SEC153_B_0X1        (0x1u<<25)
#define RIFSC_RISC_SECCFGR4_SEC152_B_0X0        (0x0u<<24)
#define RIFSC_RISC_SECCFGR4_SEC152_B_0X1        (0x1u<<24)
#define RIFSC_RISC_SECCFGR4_SEC151_B_0X0        (0x0u<<23)
#define RIFSC_RISC_SECCFGR4_SEC151_B_0X1        (0x1u<<23)
#define RIFSC_RISC_SECCFGR4_SEC150_B_0X0        (0x0u<<22)
#define RIFSC_RISC_SECCFGR4_SEC150_B_0X1        (0x1u<<22)
#define RIFSC_RISC_SECCFGR4_SEC149_B_0X0        (0x0u<<21)
#define RIFSC_RISC_SECCFGR4_SEC149_B_0X1        (0x1u<<21)
#define RIFSC_RISC_SECCFGR4_SEC148_B_0X0        (0x0u<<20)
#define RIFSC_RISC_SECCFGR4_SEC148_B_0X1        (0x1u<<20)
#define RIFSC_RISC_SECCFGR4_SEC147_B_0X0        (0x0u<<19)
#define RIFSC_RISC_SECCFGR4_SEC147_B_0X1        (0x1u<<19)
#define RIFSC_RISC_SECCFGR4_SEC146_B_0X0        (0x0u<<18)
#define RIFSC_RISC_SECCFGR4_SEC146_B_0X1        (0x1u<<18)
#define RIFSC_RISC_SECCFGR4_SEC145_B_0X0        (0x0u<<17)
#define RIFSC_RISC_SECCFGR4_SEC145_B_0X1        (0x1u<<17)
#define RIFSC_RISC_SECCFGR4_SEC144_B_0X0        (0x0u<<16)
#define RIFSC_RISC_SECCFGR4_SEC144_B_0X1        (0x1u<<16)
#define RIFSC_RISC_SECCFGR4_SEC143_B_0X0        (0x0u<<15)
#define RIFSC_RISC_SECCFGR4_SEC143_B_0X1        (0x1u<<15)
#define RIFSC_RISC_SECCFGR4_SEC142_B_0X0        (0x0u<<14)
#define RIFSC_RISC_SECCFGR4_SEC142_B_0X1        (0x1u<<14)
#define RIFSC_RISC_SECCFGR4_SEC141_B_0X0        (0x0u<<13)
#define RIFSC_RISC_SECCFGR4_SEC141_B_0X1        (0x1u<<13)
#define RIFSC_RISC_SECCFGR4_SEC140_B_0X0        (0x0u<<12)
#define RIFSC_RISC_SECCFGR4_SEC140_B_0X1        (0x1u<<12)
#define RIFSC_RISC_SECCFGR4_SEC139_B_0X0        (0x0u<<11)
#define RIFSC_RISC_SECCFGR4_SEC139_B_0X1        (0x1u<<11)
#define RIFSC_RISC_SECCFGR4_SEC138_B_0X0        (0x0u<<10)
#define RIFSC_RISC_SECCFGR4_SEC138_B_0X1        (0x1u<<10)
#define RIFSC_RISC_SECCFGR4_SEC137_B_0X0        (0x0u<<9)
#define RIFSC_RISC_SECCFGR4_SEC137_B_0X1        (0x1u<<9)
#define RIFSC_RISC_SECCFGR4_SEC136_B_0X0        (0x0u<<8)
#define RIFSC_RISC_SECCFGR4_SEC136_B_0X1        (0x1u<<8)
#define RIFSC_RISC_SECCFGR4_SEC135_B_0X0        (0x0u<<7)
#define RIFSC_RISC_SECCFGR4_SEC135_B_0X1        (0x1u<<7)
#define RIFSC_RISC_SECCFGR4_SEC134_B_0X0        (0x0u<<6)
#define RIFSC_RISC_SECCFGR4_SEC134_B_0X1        (0x1u<<6)
#define RIFSC_RISC_SECCFGR4_SEC133_B_0X0        (0x0u<<5)
#define RIFSC_RISC_SECCFGR4_SEC133_B_0X1        (0x1u<<5)
#define RIFSC_RISC_SECCFGR4_SEC132_B_0X0        (0x0u<<4)
#define RIFSC_RISC_SECCFGR4_SEC132_B_0X1        (0x1u<<4)
#define RIFSC_RISC_SECCFGR4_SEC131_B_0X0        (0x0u<<3)
#define RIFSC_RISC_SECCFGR4_SEC131_B_0X1        (0x1u<<3)
#define RIFSC_RISC_SECCFGR4_SEC130_B_0X0        (0x0u<<2)
#define RIFSC_RISC_SECCFGR4_SEC130_B_0X1        (0x1u<<2)
#define RIFSC_RISC_SECCFGR4_SEC129_B_0X0        (0x0u<<1)
#define RIFSC_RISC_SECCFGR4_SEC129_B_0X1        (0x1u<<1)
#define RIFSC_RISC_SECCFGR4_SEC128_B_0X0        (0x0u<<0)
#define RIFSC_RISC_SECCFGR4_SEC128_B_0X1        (0x1u<<0)

// RISC_SECCFGR5 Configuration

#define RIFSC_RISC_SECCFGR5_SEC191              (0x1u<<31)
#define RIFSC_RISC_SECCFGR5_SEC190              (0x1u<<30)
#define RIFSC_RISC_SECCFGR5_SEC189              (0x1u<<29)
#define RIFSC_RISC_SECCFGR5_SEC188              (0x1u<<28)
#define RIFSC_RISC_SECCFGR5_SEC187              (0x1u<<27)
#define RIFSC_RISC_SECCFGR5_SEC186              (0x1u<<26)
#define RIFSC_RISC_SECCFGR5_SEC185              (0x1u<<25)
#define RIFSC_RISC_SECCFGR5_SEC184              (0x1u<<24)
#define RIFSC_RISC_SECCFGR5_SEC183              (0x1u<<23)
#define RIFSC_RISC_SECCFGR5_SEC182              (0x1u<<22)
#define RIFSC_RISC_SECCFGR5_SEC181              (0x1u<<21)
#define RIFSC_RISC_SECCFGR5_SEC180              (0x1u<<20)
#define RIFSC_RISC_SECCFGR5_SEC179              (0x1u<<19)
#define RIFSC_RISC_SECCFGR5_SEC178              (0x1u<<18)
#define RIFSC_RISC_SECCFGR5_SEC177              (0x1u<<17)
#define RIFSC_RISC_SECCFGR5_SEC176              (0x1u<<16)
#define RIFSC_RISC_SECCFGR5_SEC175              (0x1u<<15)
#define RIFSC_RISC_SECCFGR5_SEC174              (0x1u<<14)
#define RIFSC_RISC_SECCFGR5_SEC173              (0x1u<<13)
#define RIFSC_RISC_SECCFGR5_SEC172              (0x1u<<12)
#define RIFSC_RISC_SECCFGR5_SEC171              (0x1u<<11)
#define RIFSC_RISC_SECCFGR5_SEC170              (0x1u<<10)
#define RIFSC_RISC_SECCFGR5_SEC169              (0x1u<<9)
#define RIFSC_RISC_SECCFGR5_SEC168              (0x1u<<8)
#define RIFSC_RISC_SECCFGR5_SEC167              (0x1u<<7)
#define RIFSC_RISC_SECCFGR5_SEC166              (0x1u<<6)
#define RIFSC_RISC_SECCFGR5_SEC165              (0x1u<<5)
#define RIFSC_RISC_SECCFGR5_SEC164              (0x1u<<4)
#define RIFSC_RISC_SECCFGR5_SEC163              (0x1u<<3)
#define RIFSC_RISC_SECCFGR5_SEC162              (0x1u<<2)
#define RIFSC_RISC_SECCFGR5_SEC161              (0x1u<<1)
#define RIFSC_RISC_SECCFGR5_SEC160              (0x1u<<0)

#define RIFSC_RISC_SECCFGR5_SEC191_B_0X0        (0x0u<<31)
#define RIFSC_RISC_SECCFGR5_SEC191_B_0X1        (0x1u<<31)
#define RIFSC_RISC_SECCFGR5_SEC190_B_0X0        (0x0u<<30)
#define RIFSC_RISC_SECCFGR5_SEC190_B_0X1        (0x1u<<30)
#define RIFSC_RISC_SECCFGR5_SEC189_B_0X0        (0x0u<<29)
#define RIFSC_RISC_SECCFGR5_SEC189_B_0X1        (0x1u<<29)
#define RIFSC_RISC_SECCFGR5_SEC188_B_0X0        (0x0u<<28)
#define RIFSC_RISC_SECCFGR5_SEC188_B_0X1        (0x1u<<28)
#define RIFSC_RISC_SECCFGR5_SEC187_B_0X0        (0x0u<<27)
#define RIFSC_RISC_SECCFGR5_SEC187_B_0X1        (0x1u<<27)
#define RIFSC_RISC_SECCFGR5_SEC186_B_0X0        (0x0u<<26)
#define RIFSC_RISC_SECCFGR5_SEC186_B_0X1        (0x1u<<26)
#define RIFSC_RISC_SECCFGR5_SEC185_B_0X0        (0x0u<<25)
#define RIFSC_RISC_SECCFGR5_SEC185_B_0X1        (0x1u<<25)
#define RIFSC_RISC_SECCFGR5_SEC184_B_0X0        (0x0u<<24)
#define RIFSC_RISC_SECCFGR5_SEC184_B_0X1        (0x1u<<24)
#define RIFSC_RISC_SECCFGR5_SEC183_B_0X0        (0x0u<<23)
#define RIFSC_RISC_SECCFGR5_SEC183_B_0X1        (0x1u<<23)
#define RIFSC_RISC_SECCFGR5_SEC182_B_0X0        (0x0u<<22)
#define RIFSC_RISC_SECCFGR5_SEC182_B_0X1        (0x1u<<22)
#define RIFSC_RISC_SECCFGR5_SEC181_B_0X0        (0x0u<<21)
#define RIFSC_RISC_SECCFGR5_SEC181_B_0X1        (0x1u<<21)
#define RIFSC_RISC_SECCFGR5_SEC180_B_0X0        (0x0u<<20)
#define RIFSC_RISC_SECCFGR5_SEC180_B_0X1        (0x1u<<20)
#define RIFSC_RISC_SECCFGR5_SEC179_B_0X0        (0x0u<<19)
#define RIFSC_RISC_SECCFGR5_SEC179_B_0X1        (0x1u<<19)
#define RIFSC_RISC_SECCFGR5_SEC178_B_0X0        (0x0u<<18)
#define RIFSC_RISC_SECCFGR5_SEC178_B_0X1        (0x1u<<18)
#define RIFSC_RISC_SECCFGR5_SEC177_B_0X0        (0x0u<<17)
#define RIFSC_RISC_SECCFGR5_SEC177_B_0X1        (0x1u<<17)
#define RIFSC_RISC_SECCFGR5_SEC176_B_0X0        (0x0u<<16)
#define RIFSC_RISC_SECCFGR5_SEC176_B_0X1        (0x1u<<16)
#define RIFSC_RISC_SECCFGR5_SEC175_B_0X0        (0x0u<<15)
#define RIFSC_RISC_SECCFGR5_SEC175_B_0X1        (0x1u<<15)
#define RIFSC_RISC_SECCFGR5_SEC174_B_0X0        (0x0u<<14)
#define RIFSC_RISC_SECCFGR5_SEC174_B_0X1        (0x1u<<14)
#define RIFSC_RISC_SECCFGR5_SEC173_B_0X0        (0x0u<<13)
#define RIFSC_RISC_SECCFGR5_SEC173_B_0X1        (0x1u<<13)
#define RIFSC_RISC_SECCFGR5_SEC172_B_0X0        (0x0u<<12)
#define RIFSC_RISC_SECCFGR5_SEC172_B_0X1        (0x1u<<12)
#define RIFSC_RISC_SECCFGR5_SEC171_B_0X0        (0x0u<<11)
#define RIFSC_RISC_SECCFGR5_SEC171_B_0X1        (0x1u<<11)
#define RIFSC_RISC_SECCFGR5_SEC170_B_0X0        (0x0u<<10)
#define RIFSC_RISC_SECCFGR5_SEC170_B_0X1        (0x1u<<10)
#define RIFSC_RISC_SECCFGR5_SEC169_B_0X0        (0x0u<<9)
#define RIFSC_RISC_SECCFGR5_SEC169_B_0X1        (0x1u<<9)
#define RIFSC_RISC_SECCFGR5_SEC168_B_0X0        (0x0u<<8)
#define RIFSC_RISC_SECCFGR5_SEC168_B_0X1        (0x1u<<8)
#define RIFSC_RISC_SECCFGR5_SEC167_B_0X0        (0x0u<<7)
#define RIFSC_RISC_SECCFGR5_SEC167_B_0X1        (0x1u<<7)
#define RIFSC_RISC_SECCFGR5_SEC166_B_0X0        (0x0u<<6)
#define RIFSC_RISC_SECCFGR5_SEC166_B_0X1        (0x1u<<6)
#define RIFSC_RISC_SECCFGR5_SEC165_B_0X0        (0x0u<<5)
#define RIFSC_RISC_SECCFGR5_SEC165_B_0X1        (0x1u<<5)
#define RIFSC_RISC_SECCFGR5_SEC164_B_0X0        (0x0u<<4)
#define RIFSC_RISC_SECCFGR5_SEC164_B_0X1        (0x1u<<4)
#define RIFSC_RISC_SECCFGR5_SEC163_B_0X0        (0x0u<<3)
#define RIFSC_RISC_SECCFGR5_SEC163_B_0X1        (0x1u<<3)
#define RIFSC_RISC_SECCFGR5_SEC162_B_0X0        (0x0u<<2)
#define RIFSC_RISC_SECCFGR5_SEC162_B_0X1        (0x1u<<2)
#define RIFSC_RISC_SECCFGR5_SEC161_B_0X0        (0x0u<<1)
#define RIFSC_RISC_SECCFGR5_SEC161_B_0X1        (0x1u<<1)
#define RIFSC_RISC_SECCFGR5_SEC160_B_0X0        (0x0u<<0)
#define RIFSC_RISC_SECCFGR5_SEC160_B_0X1        (0x1u<<0)

// RISC_SECCFGR6 Configuration

#define RIFSC_RISC_SECCFGR6_SEC223              (0x1u<<31)
#define RIFSC_RISC_SECCFGR6_SEC222              (0x1u<<30)
#define RIFSC_RISC_SECCFGR6_SEC221              (0x1u<<29)
#define RIFSC_RISC_SECCFGR6_SEC220              (0x1u<<28)
#define RIFSC_RISC_SECCFGR6_SEC219              (0x1u<<27)
#define RIFSC_RISC_SECCFGR6_SEC218              (0x1u<<26)
#define RIFSC_RISC_SECCFGR6_SEC217              (0x1u<<25)
#define RIFSC_RISC_SECCFGR6_SEC216              (0x1u<<24)
#define RIFSC_RISC_SECCFGR6_SEC215              (0x1u<<23)
#define RIFSC_RISC_SECCFGR6_SEC214              (0x1u<<22)
#define RIFSC_RISC_SECCFGR6_SEC213              (0x1u<<21)
#define RIFSC_RISC_SECCFGR6_SEC212              (0x1u<<20)
#define RIFSC_RISC_SECCFGR6_SEC211              (0x1u<<19)
#define RIFSC_RISC_SECCFGR6_SEC210              (0x1u<<18)
#define RIFSC_RISC_SECCFGR6_SEC209              (0x1u<<17)
#define RIFSC_RISC_SECCFGR6_SEC208              (0x1u<<16)
#define RIFSC_RISC_SECCFGR6_SEC207              (0x1u<<15)
#define RIFSC_RISC_SECCFGR6_SEC206              (0x1u<<14)
#define RIFSC_RISC_SECCFGR6_SEC205              (0x1u<<13)
#define RIFSC_RISC_SECCFGR6_SEC204              (0x1u<<12)
#define RIFSC_RISC_SECCFGR6_SEC203              (0x1u<<11)
#define RIFSC_RISC_SECCFGR6_SEC202              (0x1u<<10)
#define RIFSC_RISC_SECCFGR6_SEC201              (0x1u<<9)
#define RIFSC_RISC_SECCFGR6_SEC200              (0x1u<<8)
#define RIFSC_RISC_SECCFGR6_SEC199              (0x1u<<7)
#define RIFSC_RISC_SECCFGR6_SEC198              (0x1u<<6)
#define RIFSC_RISC_SECCFGR6_SEC197              (0x1u<<5)
#define RIFSC_RISC_SECCFGR6_SEC196              (0x1u<<4)
#define RIFSC_RISC_SECCFGR6_SEC195              (0x1u<<3)
#define RIFSC_RISC_SECCFGR6_SEC194              (0x1u<<2)
#define RIFSC_RISC_SECCFGR6_SEC193              (0x1u<<1)
#define RIFSC_RISC_SECCFGR6_SEC192              (0x1u<<0)

#define RIFSC_RISC_SECCFGR6_SEC223_B_0X0        (0x0u<<31)
#define RIFSC_RISC_SECCFGR6_SEC223_B_0X1        (0x1u<<31)
#define RIFSC_RISC_SECCFGR6_SEC222_B_0X0        (0x0u<<30)
#define RIFSC_RISC_SECCFGR6_SEC222_B_0X1        (0x1u<<30)
#define RIFSC_RISC_SECCFGR6_SEC221_B_0X0        (0x0u<<29)
#define RIFSC_RISC_SECCFGR6_SEC221_B_0X1        (0x1u<<29)
#define RIFSC_RISC_SECCFGR6_SEC220_B_0X0        (0x0u<<28)
#define RIFSC_RISC_SECCFGR6_SEC220_B_0X1        (0x1u<<28)
#define RIFSC_RISC_SECCFGR6_SEC219_B_0X0        (0x0u<<27)
#define RIFSC_RISC_SECCFGR6_SEC219_B_0X1        (0x1u<<27)
#define RIFSC_RISC_SECCFGR6_SEC218_B_0X0        (0x0u<<26)
#define RIFSC_RISC_SECCFGR6_SEC218_B_0X1        (0x1u<<26)
#define RIFSC_RISC_SECCFGR6_SEC217_B_0X0        (0x0u<<25)
#define RIFSC_RISC_SECCFGR6_SEC217_B_0X1        (0x1u<<25)
#define RIFSC_RISC_SECCFGR6_SEC216_B_0X0        (0x0u<<24)
#define RIFSC_RISC_SECCFGR6_SEC216_B_0X1        (0x1u<<24)
#define RIFSC_RISC_SECCFGR6_SEC215_B_0X0        (0x0u<<23)
#define RIFSC_RISC_SECCFGR6_SEC215_B_0X1        (0x1u<<23)
#define RIFSC_RISC_SECCFGR6_SEC214_B_0X0        (0x0u<<22)
#define RIFSC_RISC_SECCFGR6_SEC214_B_0X1        (0x1u<<22)
#define RIFSC_RISC_SECCFGR6_SEC213_B_0X0        (0x0u<<21)
#define RIFSC_RISC_SECCFGR6_SEC213_B_0X1        (0x1u<<21)
#define RIFSC_RISC_SECCFGR6_SEC212_B_0X0        (0x0u<<20)
#define RIFSC_RISC_SECCFGR6_SEC212_B_0X1        (0x1u<<20)
#define RIFSC_RISC_SECCFGR6_SEC211_B_0X0        (0x0u<<19)
#define RIFSC_RISC_SECCFGR6_SEC211_B_0X1        (0x1u<<19)
#define RIFSC_RISC_SECCFGR6_SEC210_B_0X0        (0x0u<<18)
#define RIFSC_RISC_SECCFGR6_SEC210_B_0X1        (0x1u<<18)
#define RIFSC_RISC_SECCFGR6_SEC209_B_0X0        (0x0u<<17)
#define RIFSC_RISC_SECCFGR6_SEC209_B_0X1        (0x1u<<17)
#define RIFSC_RISC_SECCFGR6_SEC208_B_0X0        (0x0u<<16)
#define RIFSC_RISC_SECCFGR6_SEC208_B_0X1        (0x1u<<16)
#define RIFSC_RISC_SECCFGR6_SEC207_B_0X0        (0x0u<<15)
#define RIFSC_RISC_SECCFGR6_SEC207_B_0X1        (0x1u<<15)
#define RIFSC_RISC_SECCFGR6_SEC206_B_0X0        (0x0u<<14)
#define RIFSC_RISC_SECCFGR6_SEC206_B_0X1        (0x1u<<14)
#define RIFSC_RISC_SECCFGR6_SEC205_B_0X0        (0x0u<<13)
#define RIFSC_RISC_SECCFGR6_SEC205_B_0X1        (0x1u<<13)
#define RIFSC_RISC_SECCFGR6_SEC204_B_0X0        (0x0u<<12)
#define RIFSC_RISC_SECCFGR6_SEC204_B_0X1        (0x1u<<12)
#define RIFSC_RISC_SECCFGR6_SEC203_B_0X0        (0x0u<<11)
#define RIFSC_RISC_SECCFGR6_SEC203_B_0X1        (0x1u<<11)
#define RIFSC_RISC_SECCFGR6_SEC202_B_0X0        (0x0u<<10)
#define RIFSC_RISC_SECCFGR6_SEC202_B_0X1        (0x1u<<10)
#define RIFSC_RISC_SECCFGR6_SEC201_B_0X0        (0x0u<<9)
#define RIFSC_RISC_SECCFGR6_SEC201_B_0X1        (0x1u<<9)
#define RIFSC_RISC_SECCFGR6_SEC200_B_0X0        (0x0u<<8)
#define RIFSC_RISC_SECCFGR6_SEC200_B_0X1        (0x1u<<8)
#define RIFSC_RISC_SECCFGR6_SEC199_B_0X0        (0x0u<<7)
#define RIFSC_RISC_SECCFGR6_SEC199_B_0X1        (0x1u<<7)
#define RIFSC_RISC_SECCFGR6_SEC198_B_0X0        (0x0u<<6)
#define RIFSC_RISC_SECCFGR6_SEC198_B_0X1        (0x1u<<6)
#define RIFSC_RISC_SECCFGR6_SEC197_B_0X0        (0x0u<<5)
#define RIFSC_RISC_SECCFGR6_SEC197_B_0X1        (0x1u<<5)
#define RIFSC_RISC_SECCFGR6_SEC196_B_0X0        (0x0u<<4)
#define RIFSC_RISC_SECCFGR6_SEC196_B_0X1        (0x1u<<4)
#define RIFSC_RISC_SECCFGR6_SEC195_B_0X0        (0x0u<<3)
#define RIFSC_RISC_SECCFGR6_SEC195_B_0X1        (0x1u<<3)
#define RIFSC_RISC_SECCFGR6_SEC194_B_0X0        (0x0u<<2)
#define RIFSC_RISC_SECCFGR6_SEC194_B_0X1        (0x1u<<2)
#define RIFSC_RISC_SECCFGR6_SEC193_B_0X0        (0x0u<<1)
#define RIFSC_RISC_SECCFGR6_SEC193_B_0X1        (0x1u<<1)
#define RIFSC_RISC_SECCFGR6_SEC192_B_0X0        (0x0u<<0)
#define RIFSC_RISC_SECCFGR6_SEC192_B_0X1        (0x1u<<0)

// RISC_SECCFGR7 Configuration

#define RIFSC_RISC_SECCFGR7_SEC255              (0x1u<<31)
#define RIFSC_RISC_SECCFGR7_SEC254              (0x1u<<30)
#define RIFSC_RISC_SECCFGR7_SEC253              (0x1u<<29)
#define RIFSC_RISC_SECCFGR7_SEC252              (0x1u<<28)
#define RIFSC_RISC_SECCFGR7_SEC251              (0x1u<<27)
#define RIFSC_RISC_SECCFGR7_SEC250              (0x1u<<26)
#define RIFSC_RISC_SECCFGR7_SEC249              (0x1u<<25)
#define RIFSC_RISC_SECCFGR7_SEC248              (0x1u<<24)
#define RIFSC_RISC_SECCFGR7_SEC247              (0x1u<<23)
#define RIFSC_RISC_SECCFGR7_SEC246              (0x1u<<22)
#define RIFSC_RISC_SECCFGR7_SEC245              (0x1u<<21)
#define RIFSC_RISC_SECCFGR7_SEC244              (0x1u<<20)
#define RIFSC_RISC_SECCFGR7_SEC243              (0x1u<<19)
#define RIFSC_RISC_SECCFGR7_SEC242              (0x1u<<18)
#define RIFSC_RISC_SECCFGR7_SEC241              (0x1u<<17)
#define RIFSC_RISC_SECCFGR7_SEC240              (0x1u<<16)
#define RIFSC_RISC_SECCFGR7_SEC239              (0x1u<<15)
#define RIFSC_RISC_SECCFGR7_SEC238              (0x1u<<14)
#define RIFSC_RISC_SECCFGR7_SEC237              (0x1u<<13)
#define RIFSC_RISC_SECCFGR7_SEC236              (0x1u<<12)
#define RIFSC_RISC_SECCFGR7_SEC235              (0x1u<<11)
#define RIFSC_RISC_SECCFGR7_SEC234              (0x1u<<10)
#define RIFSC_RISC_SECCFGR7_SEC233              (0x1u<<9)
#define RIFSC_RISC_SECCFGR7_SEC232              (0x1u<<8)
#define RIFSC_RISC_SECCFGR7_SEC231              (0x1u<<7)
#define RIFSC_RISC_SECCFGR7_SEC230              (0x1u<<6)
#define RIFSC_RISC_SECCFGR7_SEC229              (0x1u<<5)
#define RIFSC_RISC_SECCFGR7_SEC228              (0x1u<<4)
#define RIFSC_RISC_SECCFGR7_SEC227              (0x1u<<3)
#define RIFSC_RISC_SECCFGR7_SEC226              (0x1u<<2)
#define RIFSC_RISC_SECCFGR7_SEC225              (0x1u<<1)
#define RIFSC_RISC_SECCFGR7_SEC224              (0x1u<<0)

