Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_RISC_SECCFGR7_SEC255_B_0X0        (0x0u<<31)
#define RIFSC_RISC_SECCFGR7_SEC255_B_0X1        (0x1u<<31)
#define RIFSC_RISC_SECCFGR7_SEC254_B_0X0        (0x0u<<30)
#define RIFSC_RISC_SECCFGR7_SEC254_B_0X1        (0x1u<<30)
#define RIFSC_RISC_SECCFGR7_SEC253_B_0X0        (0x0u<<29)
#define RIFSC_RISC_SECCFGR7_SEC253_B_0X1        (0x1u<<29)
#define RIFSC_RISC_SECCFGR7_SEC252_B_0X0        (0x0u<<28)
#define RIFSC_RISC_SECCFGR7_SEC252_B_0X1        (0x1u<<28)
#define RIFSC_RISC_SECCFGR7_SEC251_B_0X0        (0x0u<<27)
#define RIFSC_RISC_SECCFGR7_SEC251_B_0X1        (0x1u<<27)
#define RIFSC_RISC_SECCFGR7_SEC250_B_0X0        (0x0u<<26)
#define RIFSC_RISC_SECCFGR7_SEC250_B_0X1        (0x1u<<26)
#define RIFSC_RISC_SECCFGR7_SEC249_B_0X0        (0x0u<<25)
#define RIFSC_RISC_SECCFGR7_SEC249_B_0X1        (0x1u<<25)
#define RIFSC_RISC_SECCFGR7_SEC248_B_0X0        (0x0u<<24)
#define RIFSC_RISC_SECCFGR7_SEC248_B_0X1        (0x1u<<24)
#define RIFSC_RISC_SECCFGR7_SEC247_B_0X0        (0x0u<<23)
#define RIFSC_RISC_SECCFGR7_SEC247_B_0X1        (0x1u<<23)
#define RIFSC_RISC_SECCFGR7_SEC246_B_0X0        (0x0u<<22)
#define RIFSC_RISC_SECCFGR7_SEC246_B_0X1        (0x1u<<22)
#define RIFSC_RISC_SECCFGR7_SEC245_B_0X0        (0x0u<<21)
#define RIFSC_RISC_SECCFGR7_SEC245_B_0X1        (0x1u<<21)
#define RIFSC_RISC_SECCFGR7_SEC244_B_0X0        (0x0u<<20)
#define RIFSC_RISC_SECCFGR7_SEC244_B_0X1        (0x1u<<20)
#define RIFSC_RISC_SECCFGR7_SEC243_B_0X0        (0x0u<<19)
#define RIFSC_RISC_SECCFGR7_SEC243_B_0X1        (0x1u<<19)
#define RIFSC_RISC_SECCFGR7_SEC242_B_0X0        (0x0u<<18)
#define RIFSC_RISC_SECCFGR7_SEC242_B_0X1        (0x1u<<18)
#define RIFSC_RISC_SECCFGR7_SEC241_B_0X0        (0x0u<<17)
#define RIFSC_RISC_SECCFGR7_SEC241_B_0X1        (0x1u<<17)
#define RIFSC_RISC_SECCFGR7_SEC240_B_0X0        (0x0u<<16)
#define RIFSC_RISC_SECCFGR7_SEC240_B_0X1        (0x1u<<16)
#define RIFSC_RISC_SECCFGR7_SEC239_B_0X0        (0x0u<<15)
#define RIFSC_RISC_SECCFGR7_SEC239_B_0X1        (0x1u<<15)
#define RIFSC_RISC_SECCFGR7_SEC238_B_0X0        (0x0u<<14)
#define RIFSC_RISC_SECCFGR7_SEC238_B_0X1        (0x1u<<14)
#define RIFSC_RISC_SECCFGR7_SEC237_B_0X0        (0x0u<<13)
#define RIFSC_RISC_SECCFGR7_SEC237_B_0X1        (0x1u<<13)
#define RIFSC_RISC_SECCFGR7_SEC236_B_0X0        (0x0u<<12)
#define RIFSC_RISC_SECCFGR7_SEC236_B_0X1        (0x1u<<12)
#define RIFSC_RISC_SECCFGR7_SEC235_B_0X0        (0x0u<<11)
#define RIFSC_RISC_SECCFGR7_SEC235_B_0X1        (0x1u<<11)
#define RIFSC_RISC_SECCFGR7_SEC234_B_0X0        (0x0u<<10)
#define RIFSC_RISC_SECCFGR7_SEC234_B_0X1        (0x1u<<10)
#define RIFSC_RISC_SECCFGR7_SEC233_B_0X0        (0x0u<<9)
#define RIFSC_RISC_SECCFGR7_SEC233_B_0X1        (0x1u<<9)
#define RIFSC_RISC_SECCFGR7_SEC232_B_0X0        (0x0u<<8)
#define RIFSC_RISC_SECCFGR7_SEC232_B_0X1        (0x1u<<8)
#define RIFSC_RISC_SECCFGR7_SEC231_B_0X0        (0x0u<<7)
#define RIFSC_RISC_SECCFGR7_SEC231_B_0X1        (0x1u<<7)
#define RIFSC_RISC_SECCFGR7_SEC230_B_0X0        (0x0u<<6)
#define RIFSC_RISC_SECCFGR7_SEC230_B_0X1        (0x1u<<6)
#define RIFSC_RISC_SECCFGR7_SEC229_B_0X0        (0x0u<<5)
#define RIFSC_RISC_SECCFGR7_SEC229_B_0X1        (0x1u<<5)
#define RIFSC_RISC_SECCFGR7_SEC228_B_0X0        (0x0u<<4)
#define RIFSC_RISC_SECCFGR7_SEC228_B_0X1        (0x1u<<4)
#define RIFSC_RISC_SECCFGR7_SEC227_B_0X0        (0x0u<<3)
#define RIFSC_RISC_SECCFGR7_SEC227_B_0X1        (0x1u<<3)
#define RIFSC_RISC_SECCFGR7_SEC226_B_0X0        (0x0u<<2)
#define RIFSC_RISC_SECCFGR7_SEC226_B_0X1        (0x1u<<2)
#define RIFSC_RISC_SECCFGR7_SEC225_B_0X0        (0x0u<<1)
#define RIFSC_RISC_SECCFGR7_SEC225_B_0X1        (0x1u<<1)
#define RIFSC_RISC_SECCFGR7_SEC224_B_0X0        (0x0u<<0)
#define RIFSC_RISC_SECCFGR7_SEC224_B_0X1        (0x1u<<0)

// RISC_PRIVCFGR0 Configuration

#define RIFSC_RISC_PRIVCFGR0_PRIV31             (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR0_PRIV30             (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR0_PRIV29             (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR0_PRIV28             (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR0_PRIV27             (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR0_PRIV26             (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR0_PRIV25             (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR0_PRIV24             (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR0_PRIV23             (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR0_PRIV22             (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR0_PRIV21             (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR0_PRIV20             (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR0_PRIV19             (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR0_PRIV18             (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR0_PRIV17             (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR0_PRIV16             (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR0_PRIV15             (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR0_PRIV14             (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR0_PRIV13             (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR0_PRIV12             (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR0_PRIV11             (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR0_PRIV10             (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR0_PRIV9              (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR0_PRIV8              (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR0_PRIV7              (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR0_PRIV6              (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR0_PRIV5              (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR0_PRIV4              (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR0_PRIV3              (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR0_PRIV2              (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR0_PRIV1              (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR0_PRIV0              (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR0_PRIV31_B_0X0       (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR0_PRIV31_B_0X1       (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR0_PRIV30_B_0X0       (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR0_PRIV30_B_0X1       (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR0_PRIV29_B_0X0       (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR0_PRIV29_B_0X1       (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR0_PRIV28_B_0X0       (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR0_PRIV28_B_0X1       (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR0_PRIV27_B_0X0       (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR0_PRIV27_B_0X1       (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR0_PRIV26_B_0X0       (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR0_PRIV26_B_0X1       (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR0_PRIV25_B_0X0       (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR0_PRIV25_B_0X1       (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR0_PRIV24_B_0X0       (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR0_PRIV24_B_0X1       (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR0_PRIV23_B_0X0       (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR0_PRIV23_B_0X1       (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR0_PRIV22_B_0X0       (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR0_PRIV22_B_0X1       (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR0_PRIV21_B_0X0       (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR0_PRIV21_B_0X1       (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR0_PRIV20_B_0X0       (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR0_PRIV20_B_0X1       (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR0_PRIV19_B_0X0       (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR0_PRIV19_B_0X1       (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR0_PRIV18_B_0X0       (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR0_PRIV18_B_0X1       (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR0_PRIV17_B_0X0       (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR0_PRIV17_B_0X1       (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR0_PRIV16_B_0X0       (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR0_PRIV16_B_0X1       (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR0_PRIV15_B_0X0       (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR0_PRIV15_B_0X1       (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR0_PRIV14_B_0X0       (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR0_PRIV14_B_0X1       (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR0_PRIV13_B_0X0       (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR0_PRIV13_B_0X1       (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR0_PRIV12_B_0X0       (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR0_PRIV12_B_0X1       (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR0_PRIV11_B_0X0       (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR0_PRIV11_B_0X1       (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR0_PRIV10_B_0X0       (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR0_PRIV10_B_0X1       (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR0_PRIV9_B_0X0        (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR0_PRIV9_B_0X1        (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR0_PRIV8_B_0X0        (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR0_PRIV8_B_0X1        (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR0_PRIV7_B_0X0        (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR0_PRIV7_B_0X1        (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR0_PRIV6_B_0X0        (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR0_PRIV6_B_0X1        (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR0_PRIV5_B_0X0        (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR0_PRIV5_B_0X1        (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR0_PRIV4_B_0X0        (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR0_PRIV4_B_0X1        (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR0_PRIV3_B_0X0        (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR0_PRIV3_B_0X1        (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR0_PRIV2_B_0X0        (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR0_PRIV2_B_0X1        (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR0_PRIV1_B_0X0        (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR0_PRIV1_B_0X1        (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR0_PRIV0_B_0X0        (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR0_PRIV0_B_0X1        (0x1u<<0)

