Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_RISC_PRIVCFGR3_PRIV127            (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR3_PRIV126            (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR3_PRIV125            (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR3_PRIV124            (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR3_PRIV123            (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR3_PRIV122            (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR3_PRIV121            (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR3_PRIV120            (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR3_PRIV119            (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR3_PRIV118            (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR3_PRIV117            (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR3_PRIV116            (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR3_PRIV115            (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR3_PRIV114            (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR3_PRIV113            (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR3_PRIV112            (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR3_PRIV111            (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR3_PRIV110            (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR3_PRIV109            (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR3_PRIV108            (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR3_PRIV107            (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR3_PRIV106            (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR3_PRIV105            (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR3_PRIV104            (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR3_PRIV103            (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR3_PRIV102            (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR3_PRIV101            (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR3_PRIV100            (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR3_PRIV99             (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR3_PRIV98             (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR3_PRIV97             (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR3_PRIV96             (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR3_PRIV127_B_0X0      (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR3_PRIV127_B_0X1      (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR3_PRIV126_B_0X0      (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR3_PRIV126_B_0X1      (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR3_PRIV125_B_0X0      (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR3_PRIV125_B_0X1      (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR3_PRIV124_B_0X0      (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR3_PRIV124_B_0X1      (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR3_PRIV123_B_0X0      (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR3_PRIV123_B_0X1      (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR3_PRIV122_B_0X0      (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR3_PRIV122_B_0X1      (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR3_PRIV121_B_0X0      (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR3_PRIV121_B_0X1      (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR3_PRIV120_B_0X0      (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR3_PRIV120_B_0X1      (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR3_PRIV119_B_0X0      (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR3_PRIV119_B_0X1      (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR3_PRIV118_B_0X0      (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR3_PRIV118_B_0X1      (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR3_PRIV117_B_0X0      (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR3_PRIV117_B_0X1      (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR3_PRIV116_B_0X0      (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR3_PRIV116_B_0X1      (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR3_PRIV115_B_0X0      (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR3_PRIV115_B_0X1      (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR3_PRIV114_B_0X0      (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR3_PRIV114_B_0X1      (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR3_PRIV113_B_0X0      (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR3_PRIV113_B_0X1      (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR3_PRIV112_B_0X0      (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR3_PRIV112_B_0X1      (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR3_PRIV111_B_0X0      (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR3_PRIV111_B_0X1      (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR3_PRIV110_B_0X0      (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR3_PRIV110_B_0X1      (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR3_PRIV109_B_0X0      (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR3_PRIV109_B_0X1      (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR3_PRIV108_B_0X0      (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR3_PRIV108_B_0X1      (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR3_PRIV107_B_0X0      (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR3_PRIV107_B_0X1      (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR3_PRIV106_B_0X0      (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR3_PRIV106_B_0X1      (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR3_PRIV105_B_0X0      (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR3_PRIV105_B_0X1      (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR3_PRIV104_B_0X0      (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR3_PRIV104_B_0X1      (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR3_PRIV103_B_0X0      (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR3_PRIV103_B_0X1      (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR3_PRIV102_B_0X0      (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR3_PRIV102_B_0X1      (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR3_PRIV101_B_0X0      (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR3_PRIV101_B_0X1      (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR3_PRIV100_B_0X0      (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR3_PRIV100_B_0X1      (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR3_PRIV99_B_0X0       (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR3_PRIV99_B_0X1       (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR3_PRIV98_B_0X0       (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR3_PRIV98_B_0X1       (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR3_PRIV97_B_0X0       (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR3_PRIV97_B_0X1       (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR3_PRIV96_B_0X0       (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR3_PRIV96_B_0X1       (0x1u<<0)

// RISC_PRIVCFGR4 Configuration

#define RIFSC_RISC_PRIVCFGR4_PRIV159            (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR4_PRIV158            (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR4_PRIV157            (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR4_PRIV156            (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR4_PRIV155            (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR4_PRIV154            (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR4_PRIV153            (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR4_PRIV152            (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR4_PRIV151            (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR4_PRIV150            (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR4_PRIV149            (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR4_PRIV148            (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR4_PRIV147            (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR4_PRIV146            (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR4_PRIV145            (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR4_PRIV144            (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR4_PRIV143            (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR4_PRIV142            (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR4_PRIV141            (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR4_PRIV140            (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR4_PRIV139            (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR4_PRIV138            (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR4_PRIV137            (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR4_PRIV136            (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR4_PRIV135            (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR4_PRIV134            (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR4_PRIV133            (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR4_PRIV132            (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR4_PRIV131            (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR4_PRIV130            (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR4_PRIV129            (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR4_PRIV128            (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR4_PRIV159_B_0X0      (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR4_PRIV159_B_0X1      (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR4_PRIV158_B_0X0      (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR4_PRIV158_B_0X1      (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR4_PRIV157_B_0X0      (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR4_PRIV157_B_0X1      (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR4_PRIV156_B_0X0      (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR4_PRIV156_B_0X1      (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR4_PRIV155_B_0X0      (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR4_PRIV155_B_0X1      (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR4_PRIV154_B_0X0      (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR4_PRIV154_B_0X1      (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR4_PRIV153_B_0X0      (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR4_PRIV153_B_0X1      (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR4_PRIV152_B_0X0      (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR4_PRIV152_B_0X1      (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR4_PRIV151_B_0X0      (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR4_PRIV151_B_0X1      (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR4_PRIV150_B_0X0      (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR4_PRIV150_B_0X1      (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR4_PRIV149_B_0X0      (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR4_PRIV149_B_0X1      (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR4_PRIV148_B_0X0      (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR4_PRIV148_B_0X1      (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR4_PRIV147_B_0X0      (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR4_PRIV147_B_0X1      (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR4_PRIV146_B_0X0      (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR4_PRIV146_B_0X1      (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR4_PRIV145_B_0X0      (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR4_PRIV145_B_0X1      (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR4_PRIV144_B_0X0      (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR4_PRIV144_B_0X1      (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR4_PRIV143_B_0X0      (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR4_PRIV143_B_0X1      (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR4_PRIV142_B_0X0      (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR4_PRIV142_B_0X1      (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR4_PRIV141_B_0X0      (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR4_PRIV141_B_0X1      (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR4_PRIV140_B_0X0      (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR4_PRIV140_B_0X1      (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR4_PRIV139_B_0X0      (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR4_PRIV139_B_0X1      (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR4_PRIV138_B_0X0      (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR4_PRIV138_B_0X1      (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR4_PRIV137_B_0X0      (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR4_PRIV137_B_0X1      (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR4_PRIV136_B_0X0      (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR4_PRIV136_B_0X1      (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR4_PRIV135_B_0X0      (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR4_PRIV135_B_0X1      (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR4_PRIV134_B_0X0      (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR4_PRIV134_B_0X1      (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR4_PRIV133_B_0X0      (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR4_PRIV133_B_0X1      (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR4_PRIV132_B_0X0      (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR4_PRIV132_B_0X1      (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR4_PRIV131_B_0X0      (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR4_PRIV131_B_0X1      (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR4_PRIV130_B_0X0      (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR4_PRIV130_B_0X1      (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR4_PRIV129_B_0X0      (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR4_PRIV129_B_0X1      (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR4_PRIV128_B_0X0      (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR4_PRIV128_B_0X1      (0x1u<<0)

// RISC_PRIVCFGR5 Configuration

#define RIFSC_RISC_PRIVCFGR5_PRIV191            (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR5_PRIV190            (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR5_PRIV189            (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR5_PRIV188            (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR5_PRIV187            (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR5_PRIV186            (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR5_PRIV185            (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR5_PRIV184            (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR5_PRIV183            (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR5_PRIV182            (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR5_PRIV181            (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR5_PRIV180            (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR5_PRIV179            (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR5_PRIV178            (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR5_PRIV177            (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR5_PRIV176            (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR5_PRIV175            (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR5_PRIV174            (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR5_PRIV173            (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR5_PRIV172            (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR5_PRIV171            (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR5_PRIV170            (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR5_PRIV169            (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR5_PRIV168            (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR5_PRIV167            (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR5_PRIV166            (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR5_PRIV165            (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR5_PRIV164            (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR5_PRIV163            (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR5_PRIV162            (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR5_PRIV161            (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR5_PRIV160            (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR5_PRIV191_B_0X0      (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR5_PRIV191_B_0X1      (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR5_PRIV190_B_0X0      (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR5_PRIV190_B_0X1      (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR5_PRIV189_B_0X0      (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR5_PRIV189_B_0X1      (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR5_PRIV188_B_0X0      (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR5_PRIV188_B_0X1      (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR5_PRIV187_B_0X0      (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR5_PRIV187_B_0X1      (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR5_PRIV186_B_0X0      (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR5_PRIV186_B_0X1      (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR5_PRIV185_B_0X0      (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR5_PRIV185_B_0X1      (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR5_PRIV184_B_0X0      (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR5_PRIV184_B_0X1      (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR5_PRIV183_B_0X0      (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR5_PRIV183_B_0X1      (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR5_PRIV182_B_0X0      (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR5_PRIV182_B_0X1      (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR5_PRIV181_B_0X0      (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR5_PRIV181_B_0X1      (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR5_PRIV180_B_0X0      (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR5_PRIV180_B_0X1      (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR5_PRIV179_B_0X0      (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR5_PRIV179_B_0X1      (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR5_PRIV178_B_0X0      (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR5_PRIV178_B_0X1      (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR5_PRIV177_B_0X0      (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR5_PRIV177_B_0X1      (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR5_PRIV176_B_0X0      (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR5_PRIV176_B_0X1      (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR5_PRIV175_B_0X0      (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR5_PRIV175_B_0X1      (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR5_PRIV174_B_0X0      (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR5_PRIV174_B_0X1      (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR5_PRIV173_B_0X0      (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR5_PRIV173_B_0X1      (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR5_PRIV172_B_0X0      (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR5_PRIV172_B_0X1      (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR5_PRIV171_B_0X0      (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR5_PRIV171_B_0X1      (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR5_PRIV170_B_0X0      (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR5_PRIV170_B_0X1      (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR5_PRIV169_B_0X0      (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR5_PRIV169_B_0X1      (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR5_PRIV168_B_0X0      (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR5_PRIV168_B_0X1      (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR5_PRIV167_B_0X0      (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR5_PRIV167_B_0X1      (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR5_PRIV166_B_0X0      (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR5_PRIV166_B_0X1      (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR5_PRIV165_B_0X0      (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR5_PRIV165_B_0X1      (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR5_PRIV164_B_0X0      (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR5_PRIV164_B_0X1      (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR5_PRIV163_B_0X0      (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR5_PRIV163_B_0X1      (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR5_PRIV162_B_0X0      (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR5_PRIV162_B_0X1      (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR5_PRIV161_B_0X0      (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR5_PRIV161_B_0X1      (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR5_PRIV160_B_0X0      (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR5_PRIV160_B_0X1      (0x1u<<0)

// RISC_PRIVCFGR6 Configuration

#define RIFSC_RISC_PRIVCFGR6_PRIV223            (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR6_PRIV222            (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR6_PRIV221            (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR6_PRIV220            (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR6_PRIV219            (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR6_PRIV218            (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR6_PRIV217            (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR6_PRIV216            (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR6_PRIV215            (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR6_PRIV214            (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR6_PRIV213            (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR6_PRIV212            (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR6_PRIV211            (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR6_PRIV210            (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR6_PRIV209            (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR6_PRIV208            (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR6_PRIV207            (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR6_PRIV206            (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR6_PRIV205            (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR6_PRIV204            (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR6_PRIV203            (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR6_PRIV202            (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR6_PRIV201            (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR6_PRIV200            (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR6_PRIV199            (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR6_PRIV198            (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR6_PRIV197            (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR6_PRIV196            (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR6_PRIV195            (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR6_PRIV194            (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR6_PRIV193            (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR6_PRIV192            (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR6_PRIV223_B_0X0      (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR6_PRIV223_B_0X1      (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR6_PRIV222_B_0X0      (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR6_PRIV222_B_0X1      (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR6_PRIV221_B_0X0      (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR6_PRIV221_B_0X1      (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR6_PRIV220_B_0X0      (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR6_PRIV220_B_0X1      (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR6_PRIV219_B_0X0      (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR6_PRIV219_B_0X1      (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR6_PRIV218_B_0X0      (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR6_PRIV218_B_0X1      (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR6_PRIV217_B_0X0      (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR6_PRIV217_B_0X1      (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR6_PRIV216_B_0X0      (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR6_PRIV216_B_0X1      (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR6_PRIV215_B_0X0      (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR6_PRIV215_B_0X1      (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR6_PRIV214_B_0X0      (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR6_PRIV214_B_0X1      (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR6_PRIV213_B_0X0      (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR6_PRIV213_B_0X1      (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR6_PRIV212_B_0X0      (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR6_PRIV212_B_0X1      (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR6_PRIV211_B_0X0      (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR6_PRIV211_B_0X1      (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR6_PRIV210_B_0X0      (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR6_PRIV210_B_0X1      (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR6_PRIV209_B_0X0      (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR6_PRIV209_B_0X1      (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR6_PRIV208_B_0X0      (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR6_PRIV208_B_0X1      (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR6_PRIV207_B_0X0      (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR6_PRIV207_B_0X1      (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR6_PRIV206_B_0X0      (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR6_PRIV206_B_0X1      (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR6_PRIV205_B_0X0      (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR6_PRIV205_B_0X1      (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR6_PRIV204_B_0X0      (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR6_PRIV204_B_0X1      (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR6_PRIV203_B_0X0      (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR6_PRIV203_B_0X1      (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR6_PRIV202_B_0X0      (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR6_PRIV202_B_0X1      (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR6_PRIV201_B_0X0      (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR6_PRIV201_B_0X1      (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR6_PRIV200_B_0X0      (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR6_PRIV200_B_0X1      (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR6_PRIV199_B_0X0      (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR6_PRIV199_B_0X1      (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR6_PRIV198_B_0X0      (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR6_PRIV198_B_0X1      (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR6_PRIV197_B_0X0      (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR6_PRIV197_B_0X1      (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR6_PRIV196_B_0X0      (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR6_PRIV196_B_0X1      (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR6_PRIV195_B_0X0      (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR6_PRIV195_B_0X1      (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR6_PRIV194_B_0X0      (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR6_PRIV194_B_0X1      (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR6_PRIV193_B_0X0      (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR6_PRIV193_B_0X1      (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR6_PRIV192_B_0X0      (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR6_PRIV192_B_0X1      (0x1u<<0)

// RISC_PRIVCFGR7 Configuration

