Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_RISC_PRIVCFGR7_PRIV255            (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR7_PRIV254            (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR7_PRIV253            (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR7_PRIV252            (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR7_PRIV251            (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR7_PRIV250            (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR7_PRIV249            (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR7_PRIV248            (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR7_PRIV247            (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR7_PRIV246            (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR7_PRIV245            (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR7_PRIV244            (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR7_PRIV243            (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR7_PRIV242            (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR7_PRIV241            (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR7_PRIV240            (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR7_PRIV239            (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR7_PRIV238            (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR7_PRIV237            (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR7_PRIV236            (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR7_PRIV235            (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR7_PRIV234            (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR7_PRIV233            (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR7_PRIV232            (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR7_PRIV231            (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR7_PRIV230            (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR7_PRIV229            (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR7_PRIV228            (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR7_PRIV227            (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR7_PRIV226            (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR7_PRIV225            (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR7_PRIV224            (0x1u<<0)

#define RIFSC_RISC_PRIVCFGR7_PRIV255_B_0X0      (0x0u<<31)
#define RIFSC_RISC_PRIVCFGR7_PRIV255_B_0X1      (0x1u<<31)
#define RIFSC_RISC_PRIVCFGR7_PRIV254_B_0X0      (0x0u<<30)
#define RIFSC_RISC_PRIVCFGR7_PRIV254_B_0X1      (0x1u<<30)
#define RIFSC_RISC_PRIVCFGR7_PRIV253_B_0X0      (0x0u<<29)
#define RIFSC_RISC_PRIVCFGR7_PRIV253_B_0X1      (0x1u<<29)
#define RIFSC_RISC_PRIVCFGR7_PRIV252_B_0X0      (0x0u<<28)
#define RIFSC_RISC_PRIVCFGR7_PRIV252_B_0X1      (0x1u<<28)
#define RIFSC_RISC_PRIVCFGR7_PRIV251_B_0X0      (0x0u<<27)
#define RIFSC_RISC_PRIVCFGR7_PRIV251_B_0X1      (0x1u<<27)
#define RIFSC_RISC_PRIVCFGR7_PRIV250_B_0X0      (0x0u<<26)
#define RIFSC_RISC_PRIVCFGR7_PRIV250_B_0X1      (0x1u<<26)
#define RIFSC_RISC_PRIVCFGR7_PRIV249_B_0X0      (0x0u<<25)
#define RIFSC_RISC_PRIVCFGR7_PRIV249_B_0X1      (0x1u<<25)
#define RIFSC_RISC_PRIVCFGR7_PRIV248_B_0X0      (0x0u<<24)
#define RIFSC_RISC_PRIVCFGR7_PRIV248_B_0X1      (0x1u<<24)
#define RIFSC_RISC_PRIVCFGR7_PRIV247_B_0X0      (0x0u<<23)
#define RIFSC_RISC_PRIVCFGR7_PRIV247_B_0X1      (0x1u<<23)
#define RIFSC_RISC_PRIVCFGR7_PRIV246_B_0X0      (0x0u<<22)
#define RIFSC_RISC_PRIVCFGR7_PRIV246_B_0X1      (0x1u<<22)
#define RIFSC_RISC_PRIVCFGR7_PRIV245_B_0X0      (0x0u<<21)
#define RIFSC_RISC_PRIVCFGR7_PRIV245_B_0X1      (0x1u<<21)
#define RIFSC_RISC_PRIVCFGR7_PRIV244_B_0X0      (0x0u<<20)
#define RIFSC_RISC_PRIVCFGR7_PRIV244_B_0X1      (0x1u<<20)
#define RIFSC_RISC_PRIVCFGR7_PRIV243_B_0X0      (0x0u<<19)
#define RIFSC_RISC_PRIVCFGR7_PRIV243_B_0X1      (0x1u<<19)
#define RIFSC_RISC_PRIVCFGR7_PRIV242_B_0X0      (0x0u<<18)
#define RIFSC_RISC_PRIVCFGR7_PRIV242_B_0X1      (0x1u<<18)
#define RIFSC_RISC_PRIVCFGR7_PRIV241_B_0X0      (0x0u<<17)
#define RIFSC_RISC_PRIVCFGR7_PRIV241_B_0X1      (0x1u<<17)
#define RIFSC_RISC_PRIVCFGR7_PRIV240_B_0X0      (0x0u<<16)
#define RIFSC_RISC_PRIVCFGR7_PRIV240_B_0X1      (0x1u<<16)
#define RIFSC_RISC_PRIVCFGR7_PRIV239_B_0X0      (0x0u<<15)
#define RIFSC_RISC_PRIVCFGR7_PRIV239_B_0X1      (0x1u<<15)
#define RIFSC_RISC_PRIVCFGR7_PRIV238_B_0X0      (0x0u<<14)
#define RIFSC_RISC_PRIVCFGR7_PRIV238_B_0X1      (0x1u<<14)
#define RIFSC_RISC_PRIVCFGR7_PRIV237_B_0X0      (0x0u<<13)
#define RIFSC_RISC_PRIVCFGR7_PRIV237_B_0X1      (0x1u<<13)
#define RIFSC_RISC_PRIVCFGR7_PRIV236_B_0X0      (0x0u<<12)
#define RIFSC_RISC_PRIVCFGR7_PRIV236_B_0X1      (0x1u<<12)
#define RIFSC_RISC_PRIVCFGR7_PRIV235_B_0X0      (0x0u<<11)
#define RIFSC_RISC_PRIVCFGR7_PRIV235_B_0X1      (0x1u<<11)
#define RIFSC_RISC_PRIVCFGR7_PRIV234_B_0X0      (0x0u<<10)
#define RIFSC_RISC_PRIVCFGR7_PRIV234_B_0X1      (0x1u<<10)
#define RIFSC_RISC_PRIVCFGR7_PRIV233_B_0X0      (0x0u<<9)
#define RIFSC_RISC_PRIVCFGR7_PRIV233_B_0X1      (0x1u<<9)
#define RIFSC_RISC_PRIVCFGR7_PRIV232_B_0X0      (0x0u<<8)
#define RIFSC_RISC_PRIVCFGR7_PRIV232_B_0X1      (0x1u<<8)
#define RIFSC_RISC_PRIVCFGR7_PRIV231_B_0X0      (0x0u<<7)
#define RIFSC_RISC_PRIVCFGR7_PRIV231_B_0X1      (0x1u<<7)
#define RIFSC_RISC_PRIVCFGR7_PRIV230_B_0X0      (0x0u<<6)
#define RIFSC_RISC_PRIVCFGR7_PRIV230_B_0X1      (0x1u<<6)
#define RIFSC_RISC_PRIVCFGR7_PRIV229_B_0X0      (0x0u<<5)
#define RIFSC_RISC_PRIVCFGR7_PRIV229_B_0X1      (0x1u<<5)
#define RIFSC_RISC_PRIVCFGR7_PRIV228_B_0X0      (0x0u<<4)
#define RIFSC_RISC_PRIVCFGR7_PRIV228_B_0X1      (0x1u<<4)
#define RIFSC_RISC_PRIVCFGR7_PRIV227_B_0X0      (0x0u<<3)
#define RIFSC_RISC_PRIVCFGR7_PRIV227_B_0X1      (0x1u<<3)
#define RIFSC_RISC_PRIVCFGR7_PRIV226_B_0X0      (0x0u<<2)
#define RIFSC_RISC_PRIVCFGR7_PRIV226_B_0X1      (0x1u<<2)
#define RIFSC_RISC_PRIVCFGR7_PRIV225_B_0X0      (0x0u<<1)
#define RIFSC_RISC_PRIVCFGR7_PRIV225_B_0X1      (0x1u<<1)
#define RIFSC_RISC_PRIVCFGR7_PRIV224_B_0X0      (0x0u<<0)
#define RIFSC_RISC_PRIVCFGR7_PRIV224_B_0X1      (0x1u<<0)

// RISC_RCFGLOCKR0 Configuration

#define RIFSC_RISC_RCFGLOCKR0_RLOCK31           (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK30           (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK29           (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK28           (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK27           (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK26           (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK25           (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK24           (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK23           (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK22           (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK21           (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK20           (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK19           (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK18           (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK17           (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK16           (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK15           (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK14           (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK13           (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK12           (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK11           (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK10           (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK9            (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK8            (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK7            (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK6            (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK5            (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK4            (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK3            (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK2            (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK1            (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK0            (0x1u<<0)

#define RIFSC_RISC_RCFGLOCKR0_RLOCK31_B_0X0     (0x0u<<31)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK31_B_0X1     (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK30_B_0X0     (0x0u<<30)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK30_B_0X1     (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK29_B_0X0     (0x0u<<29)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK29_B_0X1     (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK28_B_0X0     (0x0u<<28)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK28_B_0X1     (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK27_B_0X0     (0x0u<<27)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK27_B_0X1     (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK26_B_0X0     (0x0u<<26)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK26_B_0X1     (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK25_B_0X0     (0x0u<<25)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK25_B_0X1     (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK24_B_0X0     (0x0u<<24)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK24_B_0X1     (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK23_B_0X0     (0x0u<<23)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK23_B_0X1     (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK22_B_0X0     (0x0u<<22)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK22_B_0X1     (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK21_B_0X0     (0x0u<<21)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK21_B_0X1     (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK20_B_0X0     (0x0u<<20)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK20_B_0X1     (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK19_B_0X0     (0x0u<<19)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK19_B_0X1     (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK18_B_0X0     (0x0u<<18)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK18_B_0X1     (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK17_B_0X0     (0x0u<<17)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK17_B_0X1     (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK16_B_0X0     (0x0u<<16)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK16_B_0X1     (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK15_B_0X0     (0x0u<<15)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK15_B_0X1     (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK14_B_0X0     (0x0u<<14)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK14_B_0X1     (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK13_B_0X0     (0x0u<<13)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK13_B_0X1     (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK12_B_0X0     (0x0u<<12)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK12_B_0X1     (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK11_B_0X0     (0x0u<<11)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK11_B_0X1     (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK10_B_0X0     (0x0u<<10)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK10_B_0X1     (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK9_B_0X0      (0x0u<<9)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK9_B_0X1      (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK8_B_0X0      (0x0u<<8)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK8_B_0X1      (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK7_B_0X0      (0x0u<<7)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK7_B_0X1      (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK6_B_0X0      (0x0u<<6)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK6_B_0X1      (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK5_B_0X0      (0x0u<<5)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK5_B_0X1      (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK4_B_0X0      (0x0u<<4)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK4_B_0X1      (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK3_B_0X0      (0x0u<<3)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK3_B_0X1      (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK2_B_0X0      (0x0u<<2)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK2_B_0X1      (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK1_B_0X0      (0x0u<<1)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK1_B_0X1      (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK0_B_0X0      (0x0u<<0)
#define RIFSC_RISC_RCFGLOCKR0_RLOCK0_B_0X1      (0x1u<<0)

// RISC_RCFGLOCKR1 Configuration

#define RIFSC_RISC_RCFGLOCKR1_RLOCK63           (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK62           (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK61           (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK60           (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK59           (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK58           (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK57           (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK56           (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK55           (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK54           (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK53           (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK52           (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK51           (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK50           (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK49           (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK48           (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK47           (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK46           (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK45           (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK44           (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK43           (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK42           (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK41           (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK40           (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK39           (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK38           (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK37           (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK36           (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK35           (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK34           (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK33           (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR1_RLOCK32           (0x1u<<0)

