Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_RISC_RCFGLOCKR5_RLOCK191_B_0X0    (0x0u<<31)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK191_B_0X1    (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK190_B_0X0    (0x0u<<30)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK190_B_0X1    (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK189_B_0X0    (0x0u<<29)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK189_B_0X1    (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK188_B_0X0    (0x0u<<28)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK188_B_0X1    (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK187_B_0X0    (0x0u<<27)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK187_B_0X1    (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK186_B_0X0    (0x0u<<26)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK186_B_0X1    (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK185_B_0X0    (0x0u<<25)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK185_B_0X1    (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK184_B_0X0    (0x0u<<24)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK184_B_0X1    (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK183_B_0X0    (0x0u<<23)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK183_B_0X1    (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK182_B_0X0    (0x0u<<22)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK182_B_0X1    (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK181_B_0X0    (0x0u<<21)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK181_B_0X1    (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK180_B_0X0    (0x0u<<20)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK180_B_0X1    (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK179_B_0X0    (0x0u<<19)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK179_B_0X1    (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK178_B_0X0    (0x0u<<18)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK178_B_0X1    (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK177_B_0X0    (0x0u<<17)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK177_B_0X1    (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK176_B_0X0    (0x0u<<16)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK176_B_0X1    (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK175_B_0X0    (0x0u<<15)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK175_B_0X1    (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK174_B_0X0    (0x0u<<14)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK174_B_0X1    (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK173_B_0X0    (0x0u<<13)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK173_B_0X1    (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK172_B_0X0    (0x0u<<12)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK172_B_0X1    (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK171_B_0X0    (0x0u<<11)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK171_B_0X1    (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK170_B_0X0    (0x0u<<10)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK170_B_0X1    (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK169_B_0X0    (0x0u<<9)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK169_B_0X1    (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK168_B_0X0    (0x0u<<8)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK168_B_0X1    (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK167_B_0X0    (0x0u<<7)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK167_B_0X1    (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK166_B_0X0    (0x0u<<6)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK166_B_0X1    (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK165_B_0X0    (0x0u<<5)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK165_B_0X1    (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK164_B_0X0    (0x0u<<4)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK164_B_0X1    (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK163_B_0X0    (0x0u<<3)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK163_B_0X1    (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK162_B_0X0    (0x0u<<2)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK162_B_0X1    (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK161_B_0X0    (0x0u<<1)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK161_B_0X1    (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK160_B_0X0    (0x0u<<0)
#define RIFSC_RISC_RCFGLOCKR5_RLOCK160_B_0X1    (0x1u<<0)

// RISC_RCFGLOCKR6 Configuration

#define RIFSC_RISC_RCFGLOCKR6_RLOCK223          (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK222          (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK221          (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK220          (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK219          (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK218          (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK217          (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK216          (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK215          (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK214          (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK213          (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK212          (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK211          (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK210          (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK209          (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK208          (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK207          (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK206          (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK205          (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK204          (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK203          (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK202          (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK201          (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK200          (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK199          (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK198          (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK197          (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK196          (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK195          (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK194          (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK193          (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK192          (0x1u<<0)

#define RIFSC_RISC_RCFGLOCKR6_RLOCK223_B_0X0    (0x0u<<31)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK223_B_0X1    (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK222_B_0X0    (0x0u<<30)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK222_B_0X1    (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK221_B_0X0    (0x0u<<29)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK221_B_0X1    (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK220_B_0X0    (0x0u<<28)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK220_B_0X1    (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK219_B_0X0    (0x0u<<27)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK219_B_0X1    (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK218_B_0X0    (0x0u<<26)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK218_B_0X1    (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK217_B_0X0    (0x0u<<25)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK217_B_0X1    (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK216_B_0X0    (0x0u<<24)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK216_B_0X1    (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK215_B_0X0    (0x0u<<23)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK215_B_0X1    (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK214_B_0X0    (0x0u<<22)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK214_B_0X1    (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK213_B_0X0    (0x0u<<21)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK213_B_0X1    (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK212_B_0X0    (0x0u<<20)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK212_B_0X1    (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK211_B_0X0    (0x0u<<19)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK211_B_0X1    (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK210_B_0X0    (0x0u<<18)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK210_B_0X1    (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK209_B_0X0    (0x0u<<17)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK209_B_0X1    (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK208_B_0X0    (0x0u<<16)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK208_B_0X1    (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK207_B_0X0    (0x0u<<15)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK207_B_0X1    (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK206_B_0X0    (0x0u<<14)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK206_B_0X1    (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK205_B_0X0    (0x0u<<13)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK205_B_0X1    (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK204_B_0X0    (0x0u<<12)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK204_B_0X1    (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK203_B_0X0    (0x0u<<11)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK203_B_0X1    (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK202_B_0X0    (0x0u<<10)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK202_B_0X1    (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK201_B_0X0    (0x0u<<9)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK201_B_0X1    (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK200_B_0X0    (0x0u<<8)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK200_B_0X1    (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK199_B_0X0    (0x0u<<7)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK199_B_0X1    (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK198_B_0X0    (0x0u<<6)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK198_B_0X1    (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK197_B_0X0    (0x0u<<5)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK197_B_0X1    (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK196_B_0X0    (0x0u<<4)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK196_B_0X1    (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK195_B_0X0    (0x0u<<3)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK195_B_0X1    (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK194_B_0X0    (0x0u<<2)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK194_B_0X1    (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK193_B_0X0    (0x0u<<1)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK193_B_0X1    (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK192_B_0X0    (0x0u<<0)
#define RIFSC_RISC_RCFGLOCKR6_RLOCK192_B_0X1    (0x1u<<0)

