Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
// RISC_RCFGLOCKR7 Configuration

#define RIFSC_RISC_RCFGLOCKR7_RLOCK255          (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK254          (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK253          (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK252          (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK251          (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK250          (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK249          (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK248          (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK247          (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK246          (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK245          (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK244          (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK243          (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK242          (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK241          (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK240          (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK239          (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK238          (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK237          (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK236          (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK235          (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK234          (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK233          (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK232          (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK231          (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK230          (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK229          (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK228          (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK227          (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK226          (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK225          (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK224          (0x1u<<0)

#define RIFSC_RISC_RCFGLOCKR7_RLOCK255_B_0X0    (0x0u<<31)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK255_B_0X1    (0x1u<<31)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK254_B_0X0    (0x0u<<30)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK254_B_0X1    (0x1u<<30)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK253_B_0X0    (0x0u<<29)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK253_B_0X1    (0x1u<<29)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK252_B_0X0    (0x0u<<28)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK252_B_0X1    (0x1u<<28)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK251_B_0X0    (0x0u<<27)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK251_B_0X1    (0x1u<<27)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK250_B_0X0    (0x0u<<26)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK250_B_0X1    (0x1u<<26)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK249_B_0X0    (0x0u<<25)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK249_B_0X1    (0x1u<<25)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK248_B_0X0    (0x0u<<24)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK248_B_0X1    (0x1u<<24)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK247_B_0X0    (0x0u<<23)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK247_B_0X1    (0x1u<<23)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK246_B_0X0    (0x0u<<22)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK246_B_0X1    (0x1u<<22)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK245_B_0X0    (0x0u<<21)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK245_B_0X1    (0x1u<<21)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK244_B_0X0    (0x0u<<20)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK244_B_0X1    (0x1u<<20)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK243_B_0X0    (0x0u<<19)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK243_B_0X1    (0x1u<<19)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK242_B_0X0    (0x0u<<18)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK242_B_0X1    (0x1u<<18)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK241_B_0X0    (0x0u<<17)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK241_B_0X1    (0x1u<<17)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK240_B_0X0    (0x0u<<16)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK240_B_0X1    (0x1u<<16)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK239_B_0X0    (0x0u<<15)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK239_B_0X1    (0x1u<<15)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK238_B_0X0    (0x0u<<14)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK238_B_0X1    (0x1u<<14)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK237_B_0X0    (0x0u<<13)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK237_B_0X1    (0x1u<<13)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK236_B_0X0    (0x0u<<12)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK236_B_0X1    (0x1u<<12)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK235_B_0X0    (0x0u<<11)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK235_B_0X1    (0x1u<<11)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK234_B_0X0    (0x0u<<10)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK234_B_0X1    (0x1u<<10)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK233_B_0X0    (0x0u<<9)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK233_B_0X1    (0x1u<<9)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK232_B_0X0    (0x0u<<8)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK232_B_0X1    (0x1u<<8)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK231_B_0X0    (0x0u<<7)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK231_B_0X1    (0x1u<<7)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK230_B_0X0    (0x0u<<6)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK230_B_0X1    (0x1u<<6)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK229_B_0X0    (0x0u<<5)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK229_B_0X1    (0x1u<<5)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK228_B_0X0    (0x0u<<4)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK228_B_0X1    (0x1u<<4)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK227_B_0X0    (0x0u<<3)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK227_B_0X1    (0x1u<<3)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK226_B_0X0    (0x0u<<2)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK226_B_0X1    (0x1u<<2)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK225_B_0X0    (0x0u<<1)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK225_B_0X1    (0x1u<<1)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK224_B_0X0    (0x0u<<0)
#define RIFSC_RISC_RCFGLOCKR7_RLOCK224_B_0X1    (0x1u<<0)

// RIMC_CR Configuration

#define RIFSC_RIMC_CR_GLOCK                     (0x1u<<0)

#define RIFSC_RIMC_CR_GLOCK_B_0X0               (0x0u<<0)
#define RIFSC_RIMC_CR_GLOCK_B_0X1               (0x1u<<0)

// RIMC_ATTR0 Configuration

#define RIFSC_RIMC_ATTR0_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR0_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR0_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR0_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR0_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR0_MSEC_B_0X1             (0x1u<<8)

// RIMC_ATTR1 Configuration

#define RIFSC_RIMC_ATTR1_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR1_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR1_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR1_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR1_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR1_MSEC_B_0X1             (0x1u<<8)

// RIMC_ATTR2 Configuration

#define RIFSC_RIMC_ATTR2_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR2_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR2_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR2_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR2_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR2_MSEC_B_0X1             (0x1u<<8)

// RIMC_ATTR3 Configuration

#define RIFSC_RIMC_ATTR3_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR3_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR3_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR3_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR3_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR3_MSEC_B_0X1             (0x1u<<8)

// RIMC_ATTR4 Configuration

#define RIFSC_RIMC_ATTR4_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR4_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR4_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR4_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR4_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR4_MSEC_B_0X1             (0x1u<<8)

// RIMC_ATTR5 Configuration

#define RIFSC_RIMC_ATTR5_MPRIV                  (0x1u<<9)
#define RIFSC_RIMC_ATTR5_MSEC                   (0x1u<<8)

#define RIFSC_RIMC_ATTR5_MPRIV_B_0X0            (0x0u<<9)
#define RIFSC_RIMC_ATTR5_MPRIV_B_0X1            (0x1u<<9)
#define RIFSC_RIMC_ATTR5_MSEC_B_0X0             (0x0u<<8)
#define RIFSC_RIMC_ATTR5_MSEC_B_0X1             (0x1u<<8)

