Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_PPSR1_PPEN63_B_0X0                (0x0u<<31)
#define RIFSC_PPSR1_PPEN63_B_0X1                (0x1u<<31)
#define RIFSC_PPSR1_PPEN62_B_0X0                (0x0u<<30)
#define RIFSC_PPSR1_PPEN62_B_0X1                (0x1u<<30)
#define RIFSC_PPSR1_PPEN61_B_0X0                (0x0u<<29)
#define RIFSC_PPSR1_PPEN61_B_0X1                (0x1u<<29)
#define RIFSC_PPSR1_PPEN60_B_0X0                (0x0u<<28)
#define RIFSC_PPSR1_PPEN60_B_0X1                (0x1u<<28)
#define RIFSC_PPSR1_PPEN59_B_0X0                (0x0u<<27)
#define RIFSC_PPSR1_PPEN59_B_0X1                (0x1u<<27)
#define RIFSC_PPSR1_PPEN58_B_0X0                (0x0u<<26)
#define RIFSC_PPSR1_PPEN58_B_0X1                (0x1u<<26)
#define RIFSC_PPSR1_PPEN57_B_0X0                (0x0u<<25)
#define RIFSC_PPSR1_PPEN57_B_0X1                (0x1u<<25)
#define RIFSC_PPSR1_PPEN56_B_0X0                (0x0u<<24)
#define RIFSC_PPSR1_PPEN56_B_0X1                (0x1u<<24)
#define RIFSC_PPSR1_PPEN55_B_0X0                (0x0u<<23)
#define RIFSC_PPSR1_PPEN55_B_0X1                (0x1u<<23)
#define RIFSC_PPSR1_PPEN54_B_0X0                (0x0u<<22)
#define RIFSC_PPSR1_PPEN54_B_0X1                (0x1u<<22)
#define RIFSC_PPSR1_PPEN53_B_0X0                (0x0u<<21)
#define RIFSC_PPSR1_PPEN53_B_0X1                (0x1u<<21)
#define RIFSC_PPSR1_PPEN52_B_0X0                (0x0u<<20)
#define RIFSC_PPSR1_PPEN52_B_0X1                (0x1u<<20)
#define RIFSC_PPSR1_PPEN51_B_0X0                (0x0u<<19)
#define RIFSC_PPSR1_PPEN51_B_0X1                (0x1u<<19)
#define RIFSC_PPSR1_PPEN50_B_0X0                (0x0u<<18)
#define RIFSC_PPSR1_PPEN50_B_0X1                (0x1u<<18)
#define RIFSC_PPSR1_PPEN49_B_0X0                (0x0u<<17)
#define RIFSC_PPSR1_PPEN49_B_0X1                (0x1u<<17)
#define RIFSC_PPSR1_PPEN48_B_0X0                (0x0u<<16)
#define RIFSC_PPSR1_PPEN48_B_0X1                (0x1u<<16)
#define RIFSC_PPSR1_PPEN47_B_0X0                (0x0u<<15)
#define RIFSC_PPSR1_PPEN47_B_0X1                (0x1u<<15)
#define RIFSC_PPSR1_PPEN46_B_0X0                (0x0u<<14)
#define RIFSC_PPSR1_PPEN46_B_0X1                (0x1u<<14)
#define RIFSC_PPSR1_PPEN45_B_0X0                (0x0u<<13)
#define RIFSC_PPSR1_PPEN45_B_0X1                (0x1u<<13)
#define RIFSC_PPSR1_PPEN44_B_0X0                (0x0u<<12)
#define RIFSC_PPSR1_PPEN44_B_0X1                (0x1u<<12)
#define RIFSC_PPSR1_PPEN43_B_0X0                (0x0u<<11)
#define RIFSC_PPSR1_PPEN43_B_0X1                (0x1u<<11)
#define RIFSC_PPSR1_PPEN42_B_0X0                (0x0u<<10)
#define RIFSC_PPSR1_PPEN42_B_0X1                (0x1u<<10)
#define RIFSC_PPSR1_PPEN41_B_0X0                (0x0u<<9)
#define RIFSC_PPSR1_PPEN41_B_0X1                (0x1u<<9)
#define RIFSC_PPSR1_PPEN40_B_0X0                (0x0u<<8)
#define RIFSC_PPSR1_PPEN40_B_0X1                (0x1u<<8)
#define RIFSC_PPSR1_PPEN39_B_0X0                (0x0u<<7)
#define RIFSC_PPSR1_PPEN39_B_0X1                (0x1u<<7)
#define RIFSC_PPSR1_PPEN38_B_0X0                (0x0u<<6)
#define RIFSC_PPSR1_PPEN38_B_0X1                (0x1u<<6)
#define RIFSC_PPSR1_PPEN37_B_0X0                (0x0u<<5)
#define RIFSC_PPSR1_PPEN37_B_0X1                (0x1u<<5)
#define RIFSC_PPSR1_PPEN36_B_0X0                (0x0u<<4)
#define RIFSC_PPSR1_PPEN36_B_0X1                (0x1u<<4)
#define RIFSC_PPSR1_PPEN35_B_0X0                (0x0u<<3)
#define RIFSC_PPSR1_PPEN35_B_0X1                (0x1u<<3)
#define RIFSC_PPSR1_PPEN34_B_0X0                (0x0u<<2)
#define RIFSC_PPSR1_PPEN34_B_0X1                (0x1u<<2)
#define RIFSC_PPSR1_PPEN33_B_0X0                (0x0u<<1)
#define RIFSC_PPSR1_PPEN33_B_0X1                (0x1u<<1)
#define RIFSC_PPSR1_PPEN32_B_0X0                (0x0u<<0)
#define RIFSC_PPSR1_PPEN32_B_0X1                (0x1u<<0)

// PPSR2 Configuration

#define RIFSC_PPSR2_PPEN95                      (0x1u<<31)
#define RIFSC_PPSR2_PPEN94                      (0x1u<<30)
#define RIFSC_PPSR2_PPEN93                      (0x1u<<29)
#define RIFSC_PPSR2_PPEN92                      (0x1u<<28)
#define RIFSC_PPSR2_PPEN91                      (0x1u<<27)
#define RIFSC_PPSR2_PPEN90                      (0x1u<<26)
#define RIFSC_PPSR2_PPEN89                      (0x1u<<25)
#define RIFSC_PPSR2_PPEN88                      (0x1u<<24)
#define RIFSC_PPSR2_PPEN87                      (0x1u<<23)
#define RIFSC_PPSR2_PPEN86                      (0x1u<<22)
#define RIFSC_PPSR2_PPEN85                      (0x1u<<21)
#define RIFSC_PPSR2_PPEN84                      (0x1u<<20)
#define RIFSC_PPSR2_PPEN83                      (0x1u<<19)
#define RIFSC_PPSR2_PPEN82                      (0x1u<<18)
#define RIFSC_PPSR2_PPEN81                      (0x1u<<17)
#define RIFSC_PPSR2_PPEN80                      (0x1u<<16)
#define RIFSC_PPSR2_PPEN79                      (0x1u<<15)
#define RIFSC_PPSR2_PPEN78                      (0x1u<<14)
#define RIFSC_PPSR2_PPEN77                      (0x1u<<13)
#define RIFSC_PPSR2_PPEN76                      (0x1u<<12)
#define RIFSC_PPSR2_PPEN75                      (0x1u<<11)
#define RIFSC_PPSR2_PPEN74                      (0x1u<<10)
#define RIFSC_PPSR2_PPEN73                      (0x1u<<9)
#define RIFSC_PPSR2_PPEN72                      (0x1u<<8)
#define RIFSC_PPSR2_PPEN71                      (0x1u<<7)
#define RIFSC_PPSR2_PPEN70                      (0x1u<<6)
#define RIFSC_PPSR2_PPEN69                      (0x1u<<5)
#define RIFSC_PPSR2_PPEN68                      (0x1u<<4)
#define RIFSC_PPSR2_PPEN67                      (0x1u<<3)
#define RIFSC_PPSR2_PPEN66                      (0x1u<<2)
#define RIFSC_PPSR2_PPEN65                      (0x1u<<1)
#define RIFSC_PPSR2_PPEN64                      (0x1u<<0)

#define RIFSC_PPSR2_PPEN95_B_0X0                (0x0u<<31)
#define RIFSC_PPSR2_PPEN95_B_0X1                (0x1u<<31)
#define RIFSC_PPSR2_PPEN94_B_0X0                (0x0u<<30)
#define RIFSC_PPSR2_PPEN94_B_0X1                (0x1u<<30)
#define RIFSC_PPSR2_PPEN93_B_0X0                (0x0u<<29)
#define RIFSC_PPSR2_PPEN93_B_0X1                (0x1u<<29)
#define RIFSC_PPSR2_PPEN92_B_0X0                (0x0u<<28)
#define RIFSC_PPSR2_PPEN92_B_0X1                (0x1u<<28)
#define RIFSC_PPSR2_PPEN91_B_0X0                (0x0u<<27)
#define RIFSC_PPSR2_PPEN91_B_0X1                (0x1u<<27)
#define RIFSC_PPSR2_PPEN90_B_0X0                (0x0u<<26)
#define RIFSC_PPSR2_PPEN90_B_0X1                (0x1u<<26)
#define RIFSC_PPSR2_PPEN89_B_0X0                (0x0u<<25)
#define RIFSC_PPSR2_PPEN89_B_0X1                (0x1u<<25)
#define RIFSC_PPSR2_PPEN88_B_0X0                (0x0u<<24)
#define RIFSC_PPSR2_PPEN88_B_0X1                (0x1u<<24)
#define RIFSC_PPSR2_PPEN87_B_0X0                (0x0u<<23)
#define RIFSC_PPSR2_PPEN87_B_0X1                (0x1u<<23)
#define RIFSC_PPSR2_PPEN86_B_0X0                (0x0u<<22)
#define RIFSC_PPSR2_PPEN86_B_0X1                (0x1u<<22)
#define RIFSC_PPSR2_PPEN85_B_0X0                (0x0u<<21)
#define RIFSC_PPSR2_PPEN85_B_0X1                (0x1u<<21)
#define RIFSC_PPSR2_PPEN84_B_0X0                (0x0u<<20)
#define RIFSC_PPSR2_PPEN84_B_0X1                (0x1u<<20)
#define RIFSC_PPSR2_PPEN83_B_0X0                (0x0u<<19)
#define RIFSC_PPSR2_PPEN83_B_0X1                (0x1u<<19)
#define RIFSC_PPSR2_PPEN82_B_0X0                (0x0u<<18)
#define RIFSC_PPSR2_PPEN82_B_0X1                (0x1u<<18)
#define RIFSC_PPSR2_PPEN81_B_0X0                (0x0u<<17)
#define RIFSC_PPSR2_PPEN81_B_0X1                (0x1u<<17)
#define RIFSC_PPSR2_PPEN80_B_0X0                (0x0u<<16)
#define RIFSC_PPSR2_PPEN80_B_0X1                (0x1u<<16)
#define RIFSC_PPSR2_PPEN79_B_0X0                (0x0u<<15)
#define RIFSC_PPSR2_PPEN79_B_0X1                (0x1u<<15)
#define RIFSC_PPSR2_PPEN78_B_0X0                (0x0u<<14)
#define RIFSC_PPSR2_PPEN78_B_0X1                (0x1u<<14)
#define RIFSC_PPSR2_PPEN77_B_0X0                (0x0u<<13)
#define RIFSC_PPSR2_PPEN77_B_0X1                (0x1u<<13)
#define RIFSC_PPSR2_PPEN76_B_0X0                (0x0u<<12)
#define RIFSC_PPSR2_PPEN76_B_0X1                (0x1u<<12)
#define RIFSC_PPSR2_PPEN75_B_0X0                (0x0u<<11)
#define RIFSC_PPSR2_PPEN75_B_0X1                (0x1u<<11)
#define RIFSC_PPSR2_PPEN74_B_0X0                (0x0u<<10)
#define RIFSC_PPSR2_PPEN74_B_0X1                (0x1u<<10)
#define RIFSC_PPSR2_PPEN73_B_0X0                (0x0u<<9)
#define RIFSC_PPSR2_PPEN73_B_0X1                (0x1u<<9)
#define RIFSC_PPSR2_PPEN72_B_0X0                (0x0u<<8)
#define RIFSC_PPSR2_PPEN72_B_0X1                (0x1u<<8)
#define RIFSC_PPSR2_PPEN71_B_0X0                (0x0u<<7)
#define RIFSC_PPSR2_PPEN71_B_0X1                (0x1u<<7)
#define RIFSC_PPSR2_PPEN70_B_0X0                (0x0u<<6)
#define RIFSC_PPSR2_PPEN70_B_0X1                (0x1u<<6)
#define RIFSC_PPSR2_PPEN69_B_0X0                (0x0u<<5)
#define RIFSC_PPSR2_PPEN69_B_0X1                (0x1u<<5)
#define RIFSC_PPSR2_PPEN68_B_0X0                (0x0u<<4)
#define RIFSC_PPSR2_PPEN68_B_0X1                (0x1u<<4)
#define RIFSC_PPSR2_PPEN67_B_0X0                (0x0u<<3)
#define RIFSC_PPSR2_PPEN67_B_0X1                (0x1u<<3)
#define RIFSC_PPSR2_PPEN66_B_0X0                (0x0u<<2)
#define RIFSC_PPSR2_PPEN66_B_0X1                (0x1u<<2)
#define RIFSC_PPSR2_PPEN65_B_0X0                (0x0u<<1)
#define RIFSC_PPSR2_PPEN65_B_0X1                (0x1u<<1)
#define RIFSC_PPSR2_PPEN64_B_0X0                (0x0u<<0)
#define RIFSC_PPSR2_PPEN64_B_0X1                (0x1u<<0)

// PPSR3 Configuration

#define RIFSC_PPSR3_PPEN127                     (0x1u<<31)
#define RIFSC_PPSR3_PPEN126                     (0x1u<<30)
#define RIFSC_PPSR3_PPEN125                     (0x1u<<29)
#define RIFSC_PPSR3_PPEN124                     (0x1u<<28)
#define RIFSC_PPSR3_PPEN123                     (0x1u<<27)
#define RIFSC_PPSR3_PPEN122                     (0x1u<<26)
#define RIFSC_PPSR3_PPEN121                     (0x1u<<25)
#define RIFSC_PPSR3_PPEN120                     (0x1u<<24)
#define RIFSC_PPSR3_PPEN119                     (0x1u<<23)
#define RIFSC_PPSR3_PPEN118                     (0x1u<<22)
#define RIFSC_PPSR3_PPEN117                     (0x1u<<21)
#define RIFSC_PPSR3_PPEN116                     (0x1u<<20)
#define RIFSC_PPSR3_PPEN115                     (0x1u<<19)
#define RIFSC_PPSR3_PPEN114                     (0x1u<<18)
#define RIFSC_PPSR3_PPEN113                     (0x1u<<17)
#define RIFSC_PPSR3_PPEN112                     (0x1u<<16)
#define RIFSC_PPSR3_PPEN111                     (0x1u<<15)
#define RIFSC_PPSR3_PPEN110                     (0x1u<<14)
#define RIFSC_PPSR3_PPEN109                     (0x1u<<13)
#define RIFSC_PPSR3_PPEN108                     (0x1u<<12)
#define RIFSC_PPSR3_PPEN107                     (0x1u<<11)
#define RIFSC_PPSR3_PPEN106                     (0x1u<<10)
#define RIFSC_PPSR3_PPEN105                     (0x1u<<9)
#define RIFSC_PPSR3_PPEN104                     (0x1u<<8)
#define RIFSC_PPSR3_PPEN103                     (0x1u<<7)
#define RIFSC_PPSR3_PPEN102                     (0x1u<<6)
#define RIFSC_PPSR3_PPEN101                     (0x1u<<5)
#define RIFSC_PPSR3_PPEN100                     (0x1u<<4)
#define RIFSC_PPSR3_PPEN99                      (0x1u<<3)
#define RIFSC_PPSR3_PPEN98                      (0x1u<<2)
#define RIFSC_PPSR3_PPEN97                      (0x1u<<1)
#define RIFSC_PPSR3_PPEN96                      (0x1u<<0)

