Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
// PPSR5 Configuration

#define RIFSC_PPSR5_PPEN191                     (0x1u<<31)
#define RIFSC_PPSR5_PPEN190                     (0x1u<<30)
#define RIFSC_PPSR5_PPEN189                     (0x1u<<29)
#define RIFSC_PPSR5_PPEN188                     (0x1u<<28)
#define RIFSC_PPSR5_PPEN187                     (0x1u<<27)
#define RIFSC_PPSR5_PPEN186                     (0x1u<<26)
#define RIFSC_PPSR5_PPEN185                     (0x1u<<25)
#define RIFSC_PPSR5_PPEN184                     (0x1u<<24)
#define RIFSC_PPSR5_PPEN183                     (0x1u<<23)
#define RIFSC_PPSR5_PPEN182                     (0x1u<<22)
#define RIFSC_PPSR5_PPEN181                     (0x1u<<21)
#define RIFSC_PPSR5_PPEN180                     (0x1u<<20)
#define RIFSC_PPSR5_PPEN179                     (0x1u<<19)
#define RIFSC_PPSR5_PPEN178                     (0x1u<<18)
#define RIFSC_PPSR5_PPEN177                     (0x1u<<17)
#define RIFSC_PPSR5_PPEN176                     (0x1u<<16)
#define RIFSC_PPSR5_PPEN175                     (0x1u<<15)
#define RIFSC_PPSR5_PPEN174                     (0x1u<<14)
#define RIFSC_PPSR5_PPEN173                     (0x1u<<13)
#define RIFSC_PPSR5_PPEN172                     (0x1u<<12)
#define RIFSC_PPSR5_PPEN171                     (0x1u<<11)
#define RIFSC_PPSR5_PPEN170                     (0x1u<<10)
#define RIFSC_PPSR5_PPEN169                     (0x1u<<9)
#define RIFSC_PPSR5_PPEN168                     (0x1u<<8)
#define RIFSC_PPSR5_PPEN167                     (0x1u<<7)
#define RIFSC_PPSR5_PPEN166                     (0x1u<<6)
#define RIFSC_PPSR5_PPEN165                     (0x1u<<5)
#define RIFSC_PPSR5_PPEN164                     (0x1u<<4)
#define RIFSC_PPSR5_PPEN163                     (0x1u<<3)
#define RIFSC_PPSR5_PPEN162                     (0x1u<<2)
#define RIFSC_PPSR5_PPEN161                     (0x1u<<1)
#define RIFSC_PPSR5_PPEN160                     (0x1u<<0)

#define RIFSC_PPSR5_PPEN191_B_0X0               (0x0u<<31)
#define RIFSC_PPSR5_PPEN191_B_0X1               (0x1u<<31)
#define RIFSC_PPSR5_PPEN190_B_0X0               (0x0u<<30)
#define RIFSC_PPSR5_PPEN190_B_0X1               (0x1u<<30)
#define RIFSC_PPSR5_PPEN189_B_0X0               (0x0u<<29)
#define RIFSC_PPSR5_PPEN189_B_0X1               (0x1u<<29)
#define RIFSC_PPSR5_PPEN188_B_0X0               (0x0u<<28)
#define RIFSC_PPSR5_PPEN188_B_0X1               (0x1u<<28)
#define RIFSC_PPSR5_PPEN187_B_0X0               (0x0u<<27)
#define RIFSC_PPSR5_PPEN187_B_0X1               (0x1u<<27)
#define RIFSC_PPSR5_PPEN186_B_0X0               (0x0u<<26)
#define RIFSC_PPSR5_PPEN186_B_0X1               (0x1u<<26)
#define RIFSC_PPSR5_PPEN185_B_0X0               (0x0u<<25)
#define RIFSC_PPSR5_PPEN185_B_0X1               (0x1u<<25)
#define RIFSC_PPSR5_PPEN184_B_0X0               (0x0u<<24)
#define RIFSC_PPSR5_PPEN184_B_0X1               (0x1u<<24)
#define RIFSC_PPSR5_PPEN183_B_0X0               (0x0u<<23)
#define RIFSC_PPSR5_PPEN183_B_0X1               (0x1u<<23)
#define RIFSC_PPSR5_PPEN182_B_0X0               (0x0u<<22)
#define RIFSC_PPSR5_PPEN182_B_0X1               (0x1u<<22)
#define RIFSC_PPSR5_PPEN181_B_0X0               (0x0u<<21)
#define RIFSC_PPSR5_PPEN181_B_0X1               (0x1u<<21)
#define RIFSC_PPSR5_PPEN180_B_0X0               (0x0u<<20)
#define RIFSC_PPSR5_PPEN180_B_0X1               (0x1u<<20)
#define RIFSC_PPSR5_PPEN179_B_0X0               (0x0u<<19)
#define RIFSC_PPSR5_PPEN179_B_0X1               (0x1u<<19)
#define RIFSC_PPSR5_PPEN178_B_0X0               (0x0u<<18)
#define RIFSC_PPSR5_PPEN178_B_0X1               (0x1u<<18)
#define RIFSC_PPSR5_PPEN177_B_0X0               (0x0u<<17)
#define RIFSC_PPSR5_PPEN177_B_0X1               (0x1u<<17)
#define RIFSC_PPSR5_PPEN176_B_0X0               (0x0u<<16)
#define RIFSC_PPSR5_PPEN176_B_0X1               (0x1u<<16)
#define RIFSC_PPSR5_PPEN175_B_0X0               (0x0u<<15)
#define RIFSC_PPSR5_PPEN175_B_0X1               (0x1u<<15)
#define RIFSC_PPSR5_PPEN174_B_0X0               (0x0u<<14)
#define RIFSC_PPSR5_PPEN174_B_0X1               (0x1u<<14)
#define RIFSC_PPSR5_PPEN173_B_0X0               (0x0u<<13)
#define RIFSC_PPSR5_PPEN173_B_0X1               (0x1u<<13)
#define RIFSC_PPSR5_PPEN172_B_0X0               (0x0u<<12)
#define RIFSC_PPSR5_PPEN172_B_0X1               (0x1u<<12)
#define RIFSC_PPSR5_PPEN171_B_0X0               (0x0u<<11)
#define RIFSC_PPSR5_PPEN171_B_0X1               (0x1u<<11)
#define RIFSC_PPSR5_PPEN170_B_0X0               (0x0u<<10)
#define RIFSC_PPSR5_PPEN170_B_0X1               (0x1u<<10)
#define RIFSC_PPSR5_PPEN169_B_0X0               (0x0u<<9)
#define RIFSC_PPSR5_PPEN169_B_0X1               (0x1u<<9)
#define RIFSC_PPSR5_PPEN168_B_0X0               (0x0u<<8)
#define RIFSC_PPSR5_PPEN168_B_0X1               (0x1u<<8)
#define RIFSC_PPSR5_PPEN167_B_0X0               (0x0u<<7)
#define RIFSC_PPSR5_PPEN167_B_0X1               (0x1u<<7)
#define RIFSC_PPSR5_PPEN166_B_0X0               (0x0u<<6)
#define RIFSC_PPSR5_PPEN166_B_0X1               (0x1u<<6)
#define RIFSC_PPSR5_PPEN165_B_0X0               (0x0u<<5)
#define RIFSC_PPSR5_PPEN165_B_0X1               (0x1u<<5)
#define RIFSC_PPSR5_PPEN164_B_0X0               (0x0u<<4)
#define RIFSC_PPSR5_PPEN164_B_0X1               (0x1u<<4)
#define RIFSC_PPSR5_PPEN163_B_0X0               (0x0u<<3)
#define RIFSC_PPSR5_PPEN163_B_0X1               (0x1u<<3)
#define RIFSC_PPSR5_PPEN162_B_0X0               (0x0u<<2)
#define RIFSC_PPSR5_PPEN162_B_0X1               (0x1u<<2)
#define RIFSC_PPSR5_PPEN161_B_0X0               (0x0u<<1)
#define RIFSC_PPSR5_PPEN161_B_0X1               (0x1u<<1)
#define RIFSC_PPSR5_PPEN160_B_0X0               (0x0u<<0)
#define RIFSC_PPSR5_PPEN160_B_0X1               (0x1u<<0)

// PPSR6 Configuration

#define RIFSC_PPSR6_PPEN223                     (0x1u<<31)
#define RIFSC_PPSR6_PPEN222                     (0x1u<<30)
#define RIFSC_PPSR6_PPEN221                     (0x1u<<29)
#define RIFSC_PPSR6_PPEN220                     (0x1u<<28)
#define RIFSC_PPSR6_PPEN219                     (0x1u<<27)
#define RIFSC_PPSR6_PPEN218                     (0x1u<<26)
#define RIFSC_PPSR6_PPEN217                     (0x1u<<25)
#define RIFSC_PPSR6_PPEN216                     (0x1u<<24)
#define RIFSC_PPSR6_PPEN215                     (0x1u<<23)
#define RIFSC_PPSR6_PPEN214                     (0x1u<<22)
#define RIFSC_PPSR6_PPEN213                     (0x1u<<21)
#define RIFSC_PPSR6_PPEN212                     (0x1u<<20)
#define RIFSC_PPSR6_PPEN211                     (0x1u<<19)
#define RIFSC_PPSR6_PPEN210                     (0x1u<<18)
#define RIFSC_PPSR6_PPEN209                     (0x1u<<17)
#define RIFSC_PPSR6_PPEN208                     (0x1u<<16)
#define RIFSC_PPSR6_PPEN207                     (0x1u<<15)
#define RIFSC_PPSR6_PPEN206                     (0x1u<<14)
#define RIFSC_PPSR6_PPEN205                     (0x1u<<13)
#define RIFSC_PPSR6_PPEN204                     (0x1u<<12)
#define RIFSC_PPSR6_PPEN203                     (0x1u<<11)
#define RIFSC_PPSR6_PPEN202                     (0x1u<<10)
#define RIFSC_PPSR6_PPEN201                     (0x1u<<9)
#define RIFSC_PPSR6_PPEN200                     (0x1u<<8)
#define RIFSC_PPSR6_PPEN199                     (0x1u<<7)
#define RIFSC_PPSR6_PPEN198                     (0x1u<<6)
#define RIFSC_PPSR6_PPEN197                     (0x1u<<5)
#define RIFSC_PPSR6_PPEN196                     (0x1u<<4)
#define RIFSC_PPSR6_PPEN195                     (0x1u<<3)
#define RIFSC_PPSR6_PPEN194                     (0x1u<<2)
#define RIFSC_PPSR6_PPEN193                     (0x1u<<1)
#define RIFSC_PPSR6_PPEN192                     (0x1u<<0)

