Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rifsc.h
#define RIFSC_PPSR6_PPEN223_B_0X0               (0x0u<<31)
#define RIFSC_PPSR6_PPEN223_B_0X1               (0x1u<<31)
#define RIFSC_PPSR6_PPEN222_B_0X0               (0x0u<<30)
#define RIFSC_PPSR6_PPEN222_B_0X1               (0x1u<<30)
#define RIFSC_PPSR6_PPEN221_B_0X0               (0x0u<<29)
#define RIFSC_PPSR6_PPEN221_B_0X1               (0x1u<<29)
#define RIFSC_PPSR6_PPEN220_B_0X0               (0x0u<<28)
#define RIFSC_PPSR6_PPEN220_B_0X1               (0x1u<<28)
#define RIFSC_PPSR6_PPEN219_B_0X0               (0x0u<<27)
#define RIFSC_PPSR6_PPEN219_B_0X1               (0x1u<<27)
#define RIFSC_PPSR6_PPEN218_B_0X0               (0x0u<<26)
#define RIFSC_PPSR6_PPEN218_B_0X1               (0x1u<<26)
#define RIFSC_PPSR6_PPEN217_B_0X0               (0x0u<<25)
#define RIFSC_PPSR6_PPEN217_B_0X1               (0x1u<<25)
#define RIFSC_PPSR6_PPEN216_B_0X0               (0x0u<<24)
#define RIFSC_PPSR6_PPEN216_B_0X1               (0x1u<<24)
#define RIFSC_PPSR6_PPEN215_B_0X0               (0x0u<<23)
#define RIFSC_PPSR6_PPEN215_B_0X1               (0x1u<<23)
#define RIFSC_PPSR6_PPEN214_B_0X0               (0x0u<<22)
#define RIFSC_PPSR6_PPEN214_B_0X1               (0x1u<<22)
#define RIFSC_PPSR6_PPEN213_B_0X0               (0x0u<<21)
#define RIFSC_PPSR6_PPEN213_B_0X1               (0x1u<<21)
#define RIFSC_PPSR6_PPEN212_B_0X0               (0x0u<<20)
#define RIFSC_PPSR6_PPEN212_B_0X1               (0x1u<<20)
#define RIFSC_PPSR6_PPEN211_B_0X0               (0x0u<<19)
#define RIFSC_PPSR6_PPEN211_B_0X1               (0x1u<<19)
#define RIFSC_PPSR6_PPEN210_B_0X0               (0x0u<<18)
#define RIFSC_PPSR6_PPEN210_B_0X1               (0x1u<<18)
#define RIFSC_PPSR6_PPEN209_B_0X0               (0x0u<<17)
#define RIFSC_PPSR6_PPEN209_B_0X1               (0x1u<<17)
#define RIFSC_PPSR6_PPEN208_B_0X0               (0x0u<<16)
#define RIFSC_PPSR6_PPEN208_B_0X1               (0x1u<<16)
#define RIFSC_PPSR6_PPEN207_B_0X0               (0x0u<<15)
#define RIFSC_PPSR6_PPEN207_B_0X1               (0x1u<<15)
#define RIFSC_PPSR6_PPEN206_B_0X0               (0x0u<<14)
#define RIFSC_PPSR6_PPEN206_B_0X1               (0x1u<<14)
#define RIFSC_PPSR6_PPEN205_B_0X0               (0x0u<<13)
#define RIFSC_PPSR6_PPEN205_B_0X1               (0x1u<<13)
#define RIFSC_PPSR6_PPEN204_B_0X0               (0x0u<<12)
#define RIFSC_PPSR6_PPEN204_B_0X1               (0x1u<<12)
#define RIFSC_PPSR6_PPEN203_B_0X0               (0x0u<<11)
#define RIFSC_PPSR6_PPEN203_B_0X1               (0x1u<<11)
#define RIFSC_PPSR6_PPEN202_B_0X0               (0x0u<<10)
#define RIFSC_PPSR6_PPEN202_B_0X1               (0x1u<<10)
#define RIFSC_PPSR6_PPEN201_B_0X0               (0x0u<<9)
#define RIFSC_PPSR6_PPEN201_B_0X1               (0x1u<<9)
#define RIFSC_PPSR6_PPEN200_B_0X0               (0x0u<<8)
#define RIFSC_PPSR6_PPEN200_B_0X1               (0x1u<<8)
#define RIFSC_PPSR6_PPEN199_B_0X0               (0x0u<<7)
#define RIFSC_PPSR6_PPEN199_B_0X1               (0x1u<<7)
#define RIFSC_PPSR6_PPEN198_B_0X0               (0x0u<<6)
#define RIFSC_PPSR6_PPEN198_B_0X1               (0x1u<<6)
#define RIFSC_PPSR6_PPEN197_B_0X0               (0x0u<<5)
#define RIFSC_PPSR6_PPEN197_B_0X1               (0x1u<<5)
#define RIFSC_PPSR6_PPEN196_B_0X0               (0x0u<<4)
#define RIFSC_PPSR6_PPEN196_B_0X1               (0x1u<<4)
#define RIFSC_PPSR6_PPEN195_B_0X0               (0x0u<<3)
#define RIFSC_PPSR6_PPEN195_B_0X1               (0x1u<<3)
#define RIFSC_PPSR6_PPEN194_B_0X0               (0x0u<<2)
#define RIFSC_PPSR6_PPEN194_B_0X1               (0x1u<<2)
#define RIFSC_PPSR6_PPEN193_B_0X0               (0x0u<<1)
#define RIFSC_PPSR6_PPEN193_B_0X1               (0x1u<<1)
#define RIFSC_PPSR6_PPEN192_B_0X0               (0x0u<<0)
#define RIFSC_PPSR6_PPEN192_B_0X1               (0x1u<<0)

// PPSR7 Configuration

#define RIFSC_PPSR7_PPEN255                     (0x1u<<31)
#define RIFSC_PPSR7_PPEN254                     (0x1u<<30)
#define RIFSC_PPSR7_PPEN253                     (0x1u<<29)
#define RIFSC_PPSR7_PPEN252                     (0x1u<<28)
#define RIFSC_PPSR7_PPEN251                     (0x1u<<27)
#define RIFSC_PPSR7_PPEN250                     (0x1u<<26)
#define RIFSC_PPSR7_PPEN249                     (0x1u<<25)
#define RIFSC_PPSR7_PPEN248                     (0x1u<<24)
#define RIFSC_PPSR7_PPEN247                     (0x1u<<23)
#define RIFSC_PPSR7_PPEN246                     (0x1u<<22)
#define RIFSC_PPSR7_PPEN245                     (0x1u<<21)
#define RIFSC_PPSR7_PPEN244                     (0x1u<<20)
#define RIFSC_PPSR7_PPEN243                     (0x1u<<19)
#define RIFSC_PPSR7_PPEN242                     (0x1u<<18)
#define RIFSC_PPSR7_PPEN241                     (0x1u<<17)
#define RIFSC_PPSR7_PPEN240                     (0x1u<<16)
#define RIFSC_PPSR7_PPEN239                     (0x1u<<15)
#define RIFSC_PPSR7_PPEN238                     (0x1u<<14)
#define RIFSC_PPSR7_PPEN237                     (0x1u<<13)
#define RIFSC_PPSR7_PPEN236                     (0x1u<<12)
#define RIFSC_PPSR7_PPEN235                     (0x1u<<11)
#define RIFSC_PPSR7_PPEN234                     (0x1u<<10)
#define RIFSC_PPSR7_PPEN233                     (0x1u<<9)
#define RIFSC_PPSR7_PPEN232                     (0x1u<<8)
#define RIFSC_PPSR7_PPEN231                     (0x1u<<7)
#define RIFSC_PPSR7_PPEN230                     (0x1u<<6)
#define RIFSC_PPSR7_PPEN229                     (0x1u<<5)
#define RIFSC_PPSR7_PPEN228                     (0x1u<<4)
#define RIFSC_PPSR7_PPEN227                     (0x1u<<3)
#define RIFSC_PPSR7_PPEN226                     (0x1u<<2)
#define RIFSC_PPSR7_PPEN225                     (0x1u<<1)
#define RIFSC_PPSR7_PPEN224                     (0x1u<<0)

#define RIFSC_PPSR7_PPEN255_B_0X0               (0x0u<<31)
#define RIFSC_PPSR7_PPEN255_B_0X1               (0x1u<<31)
#define RIFSC_PPSR7_PPEN254_B_0X0               (0x0u<<30)
#define RIFSC_PPSR7_PPEN254_B_0X1               (0x1u<<30)
#define RIFSC_PPSR7_PPEN253_B_0X0               (0x0u<<29)
#define RIFSC_PPSR7_PPEN253_B_0X1               (0x1u<<29)
#define RIFSC_PPSR7_PPEN252_B_0X0               (0x0u<<28)
#define RIFSC_PPSR7_PPEN252_B_0X1               (0x1u<<28)
#define RIFSC_PPSR7_PPEN251_B_0X0               (0x0u<<27)
#define RIFSC_PPSR7_PPEN251_B_0X1               (0x1u<<27)
#define RIFSC_PPSR7_PPEN250_B_0X0               (0x0u<<26)
#define RIFSC_PPSR7_PPEN250_B_0X1               (0x1u<<26)
#define RIFSC_PPSR7_PPEN249_B_0X0               (0x0u<<25)
#define RIFSC_PPSR7_PPEN249_B_0X1               (0x1u<<25)
#define RIFSC_PPSR7_PPEN248_B_0X0               (0x0u<<24)
#define RIFSC_PPSR7_PPEN248_B_0X1               (0x1u<<24)
#define RIFSC_PPSR7_PPEN247_B_0X0               (0x0u<<23)
#define RIFSC_PPSR7_PPEN247_B_0X1               (0x1u<<23)
#define RIFSC_PPSR7_PPEN246_B_0X0               (0x0u<<22)
#define RIFSC_PPSR7_PPEN246_B_0X1               (0x1u<<22)
#define RIFSC_PPSR7_PPEN245_B_0X0               (0x0u<<21)
#define RIFSC_PPSR7_PPEN245_B_0X1               (0x1u<<21)
#define RIFSC_PPSR7_PPEN244_B_0X0               (0x0u<<20)
#define RIFSC_PPSR7_PPEN244_B_0X1               (0x1u<<20)
#define RIFSC_PPSR7_PPEN243_B_0X0               (0x0u<<19)
#define RIFSC_PPSR7_PPEN243_B_0X1               (0x1u<<19)
#define RIFSC_PPSR7_PPEN242_B_0X0               (0x0u<<18)
#define RIFSC_PPSR7_PPEN242_B_0X1               (0x1u<<18)
#define RIFSC_PPSR7_PPEN241_B_0X0               (0x0u<<17)
#define RIFSC_PPSR7_PPEN241_B_0X1               (0x1u<<17)
#define RIFSC_PPSR7_PPEN240_B_0X0               (0x0u<<16)
#define RIFSC_PPSR7_PPEN240_B_0X1               (0x1u<<16)
#define RIFSC_PPSR7_PPEN239_B_0X0               (0x0u<<15)
#define RIFSC_PPSR7_PPEN239_B_0X1               (0x1u<<15)
#define RIFSC_PPSR7_PPEN238_B_0X0               (0x0u<<14)
#define RIFSC_PPSR7_PPEN238_B_0X1               (0x1u<<14)
#define RIFSC_PPSR7_PPEN237_B_0X0               (0x0u<<13)
#define RIFSC_PPSR7_PPEN237_B_0X1               (0x1u<<13)
#define RIFSC_PPSR7_PPEN236_B_0X0               (0x0u<<12)
#define RIFSC_PPSR7_PPEN236_B_0X1               (0x1u<<12)
#define RIFSC_PPSR7_PPEN235_B_0X0               (0x0u<<11)
#define RIFSC_PPSR7_PPEN235_B_0X1               (0x1u<<11)
#define RIFSC_PPSR7_PPEN234_B_0X0               (0x0u<<10)
#define RIFSC_PPSR7_PPEN234_B_0X1               (0x1u<<10)
#define RIFSC_PPSR7_PPEN233_B_0X0               (0x0u<<9)
#define RIFSC_PPSR7_PPEN233_B_0X1               (0x1u<<9)
#define RIFSC_PPSR7_PPEN232_B_0X0               (0x0u<<8)
#define RIFSC_PPSR7_PPEN232_B_0X1               (0x1u<<8)
#define RIFSC_PPSR7_PPEN231_B_0X0               (0x0u<<7)
#define RIFSC_PPSR7_PPEN231_B_0X1               (0x1u<<7)
#define RIFSC_PPSR7_PPEN230_B_0X0               (0x0u<<6)
#define RIFSC_PPSR7_PPEN230_B_0X1               (0x1u<<6)
#define RIFSC_PPSR7_PPEN229_B_0X0               (0x0u<<5)
#define RIFSC_PPSR7_PPEN229_B_0X1               (0x1u<<5)
#define RIFSC_PPSR7_PPEN228_B_0X0               (0x0u<<4)
#define RIFSC_PPSR7_PPEN228_B_0X1               (0x1u<<4)
#define RIFSC_PPSR7_PPEN227_B_0X0               (0x0u<<3)
#define RIFSC_PPSR7_PPEN227_B_0X1               (0x1u<<3)
#define RIFSC_PPSR7_PPEN226_B_0X0               (0x0u<<2)
#define RIFSC_PPSR7_PPEN226_B_0X1               (0x1u<<2)
#define RIFSC_PPSR7_PPEN225_B_0X0               (0x0u<<1)
#define RIFSC_PPSR7_PPEN225_B_0X1               (0x1u<<1)
#define RIFSC_PPSR7_PPEN224_B_0X0               (0x0u<<0)
#define RIFSC_PPSR7_PPEN224_B_0X1               (0x1u<<0)
